[
    {
        "asin": "B0BCX8P7LL",
        "title": "Wonderbelly Antacid, Effective Heartburn and Instant Acid Indigestion Relief, Extra Strength Chewable Tablets, 1000 mg Calcium Carbonate, No Talc or Dye, Strawberry Milkshake, 60 Count",
        "rating": "4.5",
        "number_of_ratings": "3,193",
        "distribution": {
            "5": "73%",
            "4": "14%",
            "3": "7%",
            "2": "2%",
            "1": "4%"
        },
        "reviews": [
            {
                "rating": "5.0",
                "content": "Works like a charm.",
                "date": "December 12, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This product worked well, that was what I was hoping for.",
                "date": "December 8, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I love watermelon mint.  There are no (affordable) buying options!  (Crazy shipping of $8???).  It’s sooooo gooooood.  The best.  I dread buying a different flavor.  Huge mistake wonder belly!",
                "date": "December 7, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Just as effective as mainstream brands.This is an excellent antacid that tastes good and works great.And this has None of the chemicals that are in tums!  - Highly recommend theseBuy with confidence",
                "date": "December 5, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "better than tums  love'em",
                "date": "December 4, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Fast and effective! Very clean ingredients!",
                "date": "December 4, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "It’s true it is a good product",
                "date": "December 4, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Better than TUMS",
                "date": "December 2, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I like this because it doesn't have any weird ingredients that will have long term side effects. Natural and works great for occasional heartburn.",
                "date": "December 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Love that there's no dyes used. Dissolves well, tastes good and not sugary or a weird after taste. Worked immediately on my heartburn.",
                "date": "November 26, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Surprisingly tastes good, works well on the heartburn pretty quick on single tablet.",
                "date": "November 24, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I like that the antacid help relieved my upset stomach, size, effectiveness, smell & price. Overall, the antacid works well & my stomach is relief.",
                "date": "November 21, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "Tastes good, works well against a sour stomach. I like that it's a bit of a different flavor than your usually antiacids. I also like the metal packaging, which can be reused.",
                "date": "November 20, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "They work the same as a tums but has less unnecessary ingredients involved then a tums. No food dyes or synthetic ingredients. Also the little metal can they come in is handy for storing drill bits in after use.",
                "date": "November 20, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This is truly the best heartburn med. Tastes great and works really well. Got me through my pregnancy.",
                "date": "November 19, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I like the flavor! Choices vary. It works quickly. It’s chewable. So far, only one tablet has eased my heartburn. Thank you WonderBelly!",
                "date": "November 18, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I like that this is slightly better for you than Tums. I get heartburn often enough that that matters to me. The taste is pretty good for this type of medicine. It works.",
                "date": "November 16, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Better than the leading antacids. Wonder Belly is a product that is safe, has no additive colors or fillers and in a reusable and attractive metal container won’t leech plastics into your body.A little more spendy than the leading big name brands but well worth it for ease of mind and body. I tried the Tropical Fruit and Strawberry Milkshake and will continue to purchase the former.",
                "date": "November 15, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "First time, thinking positive, I chewed only one; didn't work.  Chewed a second one; ahhhh relief!  No strong artificial taste, making these a much better choice for me.  I've used them twice more and both times there was rapid relief.",
                "date": "November 14, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Watermelon mint is a pretty good taste for this type of medicine. Texture is the same chalky as other antacids I've tried but the ingredients list is better (no colors, no talc). I'm taking these during pregnancy for acid reflux which I've hardly ever experienced before pregnancy. I take one about 30 minutes before bedtime before I brush my teeth, and it seems to help with stomach acid issues so I can sleep better. The instructions say to take 2 but so far 1 tablet has been working for me. I like the tin these come in, too.",
                "date": "November 13, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Wow!  Bought these on a whim and can’t believe they work so well.  I have been battling constant heartburn for years (especially at night when I lay down).  I would literally wake up nauseous every morning.  I’ve tried everything from over the counter anti acids to mustard!  Nothing worked until these!  Literally a god send.  Thank you!",
                "date": "November 12, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Hands down the greatest antacid tablets I've ever had. My usual go-to options are either Tums or Kirkland-branded Tums. I didn't think there were many other alternatives outside of those that would be drastically different.That was until I had an opportunity to try these WonderBelly Antacid tablets. The packaging is very cute, and the flavor is even better! As someone who suffers from chronic heartburn, these have become my new best friends.Not only do they taste and look great, but they also work. I can see no difference between these and Tums. Actually, now that I think about it, I find myself usually only taking 2 Wonderbelly tablets vs. my normal dose of 4 Tums tablets.If you also suffer from chronic heartburn, do yourself a favor and give these a try for yourself!",
                "date": "November 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "We are so used to hearing about Tums, but I honestly I never would have heard about this if I wasn't look up items from FSA. I'm glad I did, these tablets smell pleasant but the taste was subtle and not chalky. If you don't chew the tablets they last a while in your mouth. If you do chew them, it doesn't get stuck to your teeth as much. Does what it's supposed to. I like that there is a variety of flavors and you can pick the flavor you like instead of getting stuck with variety bottle.",
                "date": "November 11, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I have to make antiacid available these days.  I've never given much thought about it and have bought store brand - the cheaper the better.  These are different.  They are advertised to be dye free, artificial sweetener free, paraben free, dairy free, and gluten free.  The company has other items as well that they advertise as being better options because of better ingredients.  They come in a large tin container with 120 tablets.  The tablets don't seem as chalky as the other stuff.  They were completely pleasurable to chew and worked as well as other antiacids do for me.  The active ingredient is the same.  If you care about what goes into your body, these would be a good option for you.",
                "date": "November 10, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I have now ordered 3 bottles of these because they taste better than other brands and they actually work!",
                "date": "November 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I really love this product and would highly recommend it . Very easy on tummy . And tastes good too! Definitely will buy more of these !",
                "date": "November 8, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I got this for a Vine product review for the odd times I experience stomach issues and for my mom to use who has acid indigestion more often.Of course, now that I have them I have not had any problems but decided to try them out anyway. At least I would know the taste and even if they make you feel nauseous if taken when not necessarily to test out.  I've taken others in the past that actually make me feel worse so I figure if it does not make me sick when I do not need it them it will certainly not do so when I do.At this time I can say that it tastes fine and it did not make me feel off.  My mom on the other hand, was suffering from some indigestion after eating a few too many sweet and sour shrimp and she took one.  She said it is not something she can chew because the taste and texture were not her favorite.  However, she said if she breaks it into pieces and swallows it as you would aspirin then she's fine with that and that it did in fact ease her discomfort quite quickly.So from 2 people testing this out in the same house: we recommend!  Not to mention $19.99 for 120 tablets is quite a great price!",
                "date": "November 7, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Wow! I love these. They taste great.",
                "date": "November 6, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Exactly what was expected",
                "date": "November 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Works well for temporary relief",
                "date": "November 3, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These are fine. They taste pretty well, better than alternatives. Of course they don't taste that great but none of these types of products do. They contain the type of compound that is common for this application. Seems like a good source.",
                "date": "November 3, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "But...would pay this much for antacids again.",
                "date": "November 2, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I ordered these because I read a review on. Them that they work well! And they came quickly and taste good!! Some things I’ve gotten leave A bad after taste!!",
                "date": "November 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This is a different kind of antacid for me. I'm so used to the nasty chalky minty ones. These are smooth and are tasty. So I don't even feel like I'm having medicine. It helps my heartburn and stomach discomfort. It's effective and works quickly.",
                "date": "November 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I bought lemon sorbet. It's a very meyer lemony taste, sweet, not sharp or tart. I got my first tin as gift from my sister after I complained about the chalky aftertaste of my usual Tums/Rolaids. Wonderbelly works equally as well as those others for me. It's comparatively expensive but as it uaually takes me a couple months to go through an 80 count tin it's not a frequent expense. The small splurge is worth it to me not to have a mouthfuls of minty chalk.  😁",
                "date": "November 1, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This arrived from the vendor in a branded box that had come open during shipment. The canister was not harmed. The canister had a tamper evident seal, & a best by date clearly printed on the bottom “2026MAY”.We substituted these for our normal stuff, and these are more engaging & a better experience from a taste point of view.Actual effectiveness — they get the job done, and you have to love the container.I might not get these every time, but I’d order these again & use them in-between less expensive alternatives.",
                "date": "October 31, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "These are really chalky and I'm not over the moon about the taste, but they work really really well. This tin holds a lot and should last a long time.",
                "date": "October 29, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I am a person who gets sour stomach very easily. My go to product is no longer available, so I searched for an alternative that didn't leave that chalky feeling on  your tongue and in your mouth.These are WONDERFUL.  Pop one in an let it melt. Normally, 15 minutes and sour stomach is gone.There are now on an auto shipment every other month.",
                "date": "October 27, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "works",
                "date": "October 27, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "The media could not be loaded.\n                \n\n\n\nGood taste, work well",
                "date": "October 27, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Best antacid I've ever used. Not to hard or soft.  Taste is great. I use the strawberry.  They don't have any extra additives so while the seem expensive you need a much smaller amount to get stomach relief. Highly recommend them.  They come in a metal, recyclable container.",
                "date": "October 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Loved these tablets, perfect to take anywhere, easy to chew and taste is very good. Good for relieving stomach acidity and ingestion.",
                "date": "October 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I’ve only used Tums and when I saw these I thought I would give them a try. I chose the strawberry milkshake and they taste and smell good. I think they work better than Tums also. Although the bottle is only 60 tablets and cost more but I would still purchase again.",
                "date": "October 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These are the best anti-acids tablets I’ve ever used.  And as a teacher (retired) I’ve used a lot of anti-acids.",
                "date": "October 23, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Great flavor and nice to have on hand. Super convenient too. I love that there no talc or dyes.",
                "date": "October 23, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "Good price, effective.",
                "date": "October 22, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "My husband and I started searching for a much healthier way to combat acid reflex we used to use Tums until we read the long term affects of that product. So we began to research and look on Amazon for a better solution. We are happy with the results of this product, the Wonderbelly works for us! Try it!",
                "date": "October 22, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Taste better than tums. Doesn't have a chalky taste. Smells great many tasty flavors.",
                "date": "October 22, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "this is a nice alternative",
                "date": "October 21, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I absolutely love Wonderbelly Antacid! These chewable tablets taste fantastic, and I appreciate that they’re vegan. They work well for me and provide quick relief. The reusable tin is a nice touch, but I really wish the brand would offer refills for it.",
                "date": "October 19, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I got the strawberry milkshake flavor. I like that the ingredients are clean, and the fact that the container is metal, which is easily recyclable in my area, and the tin design is cute.  The flavor is really nice and my acid reflux seems to just disappear when I take these.  Really loving these much more so than the tums.",
                "date": "October 18, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Always works and tastes great.",
                "date": "October 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These work well and taste great.  The tin can is fantastic to keep the tablets from getting broken and does a good job of sealing them up.",
                "date": "October 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I don't like to use antacid very often but when I do, its usually tums, and it creates this ongoing pattern of having to use it again and I just really dislike the taste of tums, so I thought this would be worth a try. I've been pleasantly surprised. It works quickly and has a pretty light taste.I feel better about using this than other antacids. I'm happy with this and would recommend it.",
                "date": "October 16, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This Wonderbelly Antacid is easy to take and it's gentle on my stomach. It's easy to take, tastes pretty good and is effective. I love that this doesn't taste chalky and that it is non-GMO and free from talc, dairy, and parabans. Overall, I'm quite happy with this product and will continue to use it.",
                "date": "October 15, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Everything from the function to presentation of these is flawless. A great flavor, fast acting, and pleasing aesthetic to both the tablets and the lovely aluminum tin. All in all, absolute top marks. Fully recommended.",
                "date": "October 15, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These work fairly quickly in resolving any acid or indigestion troubles I am having. I sometimes need some in the morning, and I need a cup of coffee, they help me enjoy my coffee without the stomach issues. They are not chalky and the flavors are mild. The container will keep them fresh and you get a lot in it.",
                "date": "October 15, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "These strawberry milkshake-flavored chewable tablets work just as well without all the unnecessary additives. They provide quick relief from heartburn and indigestion, and the flavor is surprisingly tasty—like a creamy strawberry treat! I also appreciate that they are vegan and free from artificial dyes and talc.",
                "date": "October 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This Wonderbelly antacid worked very quickly in relieving my symptoms after eating a spicy meal. I was able to sleep comfortably and hadn't realized before taking these antacids that I should take them when eating something that upsets my stomach. I chewed 2 antacids and will take them as needed whenever I have heartburn, acid indigestion, or a sour stomach. The tropical fruit flavor is yummy tasting, and I appreciate the simplicity of the ingredients.",
                "date": "October 13, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "These are just Tums, sure, but one of the nicest smelling and tasting Tums I've had the pleasure to eat. I also appreciate the absence of dyes and artificial sweeteners. I would have similar praise for the use of a metal tin rather than plastic, which I think is generally a good idea, but I think because the metal is harder than the plastic a product like this would normally be packaged in, more of them got broken in shipping. They work just the same even when broken, though I am a little worried about how much powder I'm going to find in the bottom of the tin. I'll give them a pass since the rest is good.",
                "date": "October 13, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These Wonder Belly antacid worked well.  I like that these contain only calcium carbonate. Instructions are very well written, recommending one table for mild ingestion and up to 3 tablets for strong discomfort.  I tried two and they worked well for a moderate discomfort.  This is an ample supply of antacid tablets that arrive in a sturdy metal container.  I had the \"tropical fruit\" flavored tablets.  Would have preferred a mint flavor but the fruit flavor was not off-putting.",
                "date": "October 12, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "The Wonderbelly antacids work great. They provide quick relief in a tasty chewable tablet containing 1000mg calcium carbonate per tablet. The strawberry milkshake flavor is pleasant without being too sweet. They have a chalky texture similar to other antacid tablets, but they are easy to chew and go down easily. It's a must have for me for a number of stomach issuesI also like the packaging. They come in a tin that gives them a unique look. It kind of reminds me of old school packaging from a long time ago",
                "date": "October 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I have terrible acid reflux and these work surprisingly well. I usually hate the “chalky” chewables but these are actually pretty good. I’ll definitely buy these again instead of Tums.",
                "date": "October 12, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I'm a health girlie who had some reflux from iron tablets.My husband is deployed and gets me to send these over he loves them so much.Clean ingredients and instantly works.Chewable like candy",
                "date": "October 11, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Works very well as an antacid.  Flavor is nice.  Better than fruit flavored antacids widely available.  These seem to work better and taste better.",
                "date": "October 11, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I figured this would be the same as every other antacid I’ve tried, but this one impressed me. Not only is the flavor quite nice, but it works really well and most importantly, no funky aftertaste!!  That’s my biggest pet peeve with these products, but this one got it right.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "These are probably some of the best antacids out there. They taste good and are effective and long lasting. They are a little chalky, but I dont mind that. They get rid of heartburn pretty quickly.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This works just as well as Tums or rolaids that I've used. The main difference being that I like the taste of these better than Tums. It still has that chalky taste that all antacids have, but this one has a nice light strawberry flavor.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "$18 for 120 antacid tablets is overpriced compared to the usual brands that give you more tablets for the same price, but these do not have any food dyes or other weird ingredients. The tropical fruit flavor isn't super noticeable, but these don't taste bad at all! Wonderbelly is a safe brand to order supplements from, the tamper proof seal leaves behind bits of the foil sticker when peeled off...so you will DEFINITELY know if someone has tampered with it before it gets to you!",
                "date": "October 9, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "This extra strength antacid works wonders for my heartburn and the flavor is tasty. I like the fact that it is chewable and more enjoyable than typical chalky versions. It comes with 120 tablets which is great for the price. It's definitely one of the better antacids I've tried.🙂",
                "date": "October 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I have suffered from gerd for many years. I have hated how much over the counter antacids I take with their artificial ingredients and with no relief, but had no real choice. When I stumbled across these I was very skeptical as it takes a lot to help my acid. I was very surprised how well these worked!! Gave me the relief I needed and didn’t make me feel guilty taking them with the cleaner ingredient options. My husband also switched to these and found the relief he needed. They taste pretty good too. May be a little more expensive then the others but I was taking multiple of those compared to wonder belly, so the little extra price was worth it.",
                "date": "October 9, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I love this product for my family so much more than the leading brand!! I hope they never change their formula because this has been such a blessing!!!",
                "date": "October 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These antacids smell and taste great compared to the other brands I've used. They aren't quite as chalky either. I appreciate the lack of extra additives and also the cute bottle. I think they seem to be as effective as any other antacid of this type.",
                "date": "October 8, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Has a better texture than any other antacid I’ve tried.",
                "date": "October 6, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Very good flavors. Value for the price.",
                "date": "October 5, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Pregnancy heartburn is the worst. These are the best. Almost instant relief. Ans they tast really good. Smell goof too. Size of a tums",
                "date": "October 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Fast acting.",
                "date": "October 1, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Very nice ,the taste is mild n flavorfull.",
                "date": "September 30, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I’ll be honest, these are super expensive compared to Tums, but my offbrand tums weren’t cutting it in the final trimester of pregnancy. Im not much on Tums berry flavors either, I miss mint. I do like the strawberry milkshake, I prefer the light chalky flavor over the somewhat acidic nature of strong berry flavor tums. Somehow these work better for me. Maybe the better ingredients are easier on my stomach. It seems to work much quicker too. I just wish it was less expensive.",
                "date": "September 29, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Okay, i lost my taste and smell a few years ago so as far as texture goes, the first time it's chalky and dry as you'd expect but then... Anytime after that, they've been... Not miserable at all.  They don't have that...chew to them....if you know what I mean.  It's definitely more like straight flavored calcium carbonate than random bits so....im good with that.  A teacher I used to have ate his chalk sometimes.  Makes absolute sense now.  Poor guy must have had it so bad.  Esophagus goes out to you mr. Williams.  My husband ACTUALLY TAKES THEM! and both daughters said mmmm when they tried one.  Red sauce family, I suppose.  Just popping on to purchase more, I'd like to keep them around the house.  They're a bit expensive so, a sale would be cool.  They're about the size of all the other brands \"T\".",
                "date": "September 27, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "My new go-to antacid",
                "date": "September 27, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "The Strawberry Milkshake flavor is the most delicious antacid I've ever tried. They truly taste like a milkshake albeit not as sweet. The canister is completely metal and has an excellent safety seal. In fact, I recommend cutting the side tab off, because if you pull it off the top, it mars the otherwise cute packaging by tearing the paint and saying 'void'. Those paranoid about factory seal needn't worry.I need to stop myself from eating more than I need :)",
                "date": "September 27, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I got the watermelon mint flavour and it's the best. they give me instant relief from stomach pains, I have alot of stomach problems like burning/trapped gas/ general aches and these help so much. much better and cleaner than pepto and they taste great, I wish they were candies so I could have more of them",
                "date": "September 27, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I don't like the fake and full of dyes antacids out there. They taste terrible and are often filled with artificial ingredients. However, this natural antacid that not only tastes better but also does not contain any dyes, making it a healthier choice. This natural antacid effectively resolves the problem right away, providing quick relief from discomfort. Additionally, it comes in a very well-designed and practical can, making it convenient to carry with you wherever you go.",
                "date": "September 26, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Love it!!! It works in less than 2 minutes. No more heartburn for me. I completely agree that this product is very effective and only the best ingredients . Such a great product !!",
                "date": "September 26, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Fast, and effective heartburn medication.  great tasting too,",
                "date": "September 24, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Just one tablet works as well if not better than a leading national brand (that I have to take two - four of to get the same antiacid relief. Highly recommend.",
                "date": "September 21, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Normally the ones I get are too sweet and made me sick to my stomach, but these ones have a light taste that isn't too sweet and work very fast.",
                "date": "September 21, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Wow, I am a fan of this stuff! Currently in my third trimester of pregnancy, and the acid reflux when I try to sleep is AWFUL. I have woken up choking, and thought I'd have to spend the rest of my days suffering. I was recommended Tums, but didn't want the talc and dyes, so I set out to find an alternative. Wonderbelly was exactly what I was looking for, and after taking it for the first time, it WORKED! I got the watermelon mint flavor, and found it to be a great taste. 10/10 would recommend this product to anyone!",
                "date": "September 20, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "The media could not be loaded.\n                \n\n\n\nWonder Belly is truly wonderful! It works nearly immediately for super quick relief! The taste is much better than most products out there, plus the clean ingredients are a major plus for me. I love that the container is small enough to toss in my purse, and the tablets themselves are a perfect size as well.",
                "date": "September 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Works better than tums do and also have a much better flavor as well.",
                "date": "September 17, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These have a great taste compared to other brands. It's also nice to know there is less junk put into these tablets that are put into your body. I will continue to purchase these over Tums.",
                "date": "September 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "So much to love! First and best: The antacid comes in a sturdy metal container that won't get crushed in your purse, small yet holds12.Second: the strawberry milkshake is delicious. Not too sweet yet so good.3rd: works fast!!!!!!!4th: affordableI highly recommend this antacid!!",
                "date": "September 16, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Works and tastes good",
                "date": "September 15, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I love these antacids! I struggle with heartburn, and I am not a huge fan of Tums. These were a huge game changer for me!",
                "date": "September 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Gentle on system.",
                "date": "September 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "My husband and I both use Wonder Belly for indigestion.  Relief comes in minutes. Tastes good, too!",
                "date": "September 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Thank you for making a simple remedy. I do like the mild flavors. I purchased the Lemon Sorbet and the Strawberry & Cream. They work.  Will recommend to friends!",
                "date": "September 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These are flat out awesome. I don't get acid reflux and indigestion enough to make me go to the doctor and get a prescription, but oh buddy when I get it I'm miserable. As much as I know mint is a great aid for tummy troubles, the idea of eating chewing gum or toothpaste makes me want to toss my cookies. The mint in this is so mild and the watermelon is very fresh and not that sickly sweet artificial flavor. They're of course kind of chalky because that's how it works, but the texture and taste are the best I've ever had for a product like this. You feel the effect almost immediately. Even my mint hating husband only said \"I can still taste the mint\" when I convinced him to take some from the regret of a late night pizza",
                "date": "September 8, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "But due to my extremely low income I may not purchase again.",
                "date": "September 3, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These have more natural ingredients than store name brands I compared them to. The taste is mild and the chalkiness is tolerable. Probably the best feature is that I get the result with 1 to 2 of these that I get having to use 3 to 4 of another, less costly, brand.",
                "date": "November 25, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I tried this product and it had a very good flavor, minus all the bad stuff, which I very much appreciate. It does taste chalky but that’s calcium. However, if you have “issues” with calcium, use with caution!! Little did I know that 1 dose would cause horrible constipation in me, which contributed to a less-than-ideal colon procedure. Any type of partial bowel obstruction may act against you with calcium, and greatly increase pain. Other than that, it seems like a fantastic product under the right conditions.",
                "date": "November 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These tablets taste and work great, my only complaint is that the powder just gets absolutely everywhere when you open the jar.  Maybe mine was particularly shaken up in the journey, I'm not sure. But it's worth it because they do their job well!",
                "date": "November 14, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "Had to confirm with the company on manufacturing location because it's not clear on the packaging. Website doesn't say clearly either so I had to contact support.Overall, this is medicine that tastes like candy. Made in the USA. Good communication and customer support. Sustainable packaging.",
                "date": "November 8, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "don't taste great, do the job, vegan!",
                "date": "November 6, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "ok",
                "date": "November 3, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Easy to stop the acid!",
                "date": "October 24, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "Little pricey and low volume but works good ,tastes fine.",
                "date": "October 23, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Tums, or a store brand version of Tums, are something we go through quickly at our house.  We usually buy the mint flavor, but occasionally get stuck with the fruit flavored ones, which I generally don't like.  Surprisingly, these Wonderbelly Tropical Fruit antacids taste pretty good.  They are mild and not offensive.  Same chalky taste as other brands, but there's no getting away from that.  They come in a cute reusable metal can screw top can.  But compared to what we usually buy, they are at least twice as expensive, so it's hard to justify the cost for a reorder.",
                "date": "October 20, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "You get a whole bunch of tablets in a can, which is great.  It has a faint fruit smell and taste.  It definitely tastes different from the store bought ones.  I like that it’s not sweet.  I’ve been taking it for a bit and it works as well as store bought ones.  I feel better that there is less harmful chemicals.",
                "date": "October 19, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I like the tin cannister these come in it's kind of I don't know retro maybe? I made taco hotdish and KNEW as always being it's spicy I'd have issues. So I waited to try these or see how effective they were. They have the chew of a typical antacid tablet not chalky just the same consistancy. The flavor is strawberry milkshake but I'm not sure if I'd necessarily call it that. They do have a creamy strawberry flavor and quite good to be honest but it well doesn't remind ME so much of a strawberry milkshake I guess. I took two tablets after I started having issues with the ghost of my taco hotdish kicking in. They worked great on the first dose. So two thumbs up there as with my regular antacid I sometimes find myself taking a second dose or two tablets. I'm happy with these not only how they work but they taste better than the chalky wintergreen flavor or mint flavor of what I typically buy. I tried fruit flavored types but in the past but didn't find them to my liking like these.",
                "date": "October 16, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Our household suffers from heartburn and indigestion often and Tums is a staple but it seems to upset my stomach so I avoid it. I decided to try this one because it has the same active ingredient but different inactive ingredients and to my delight, this one does not upset my stomach. I would give it 5 stars but it is about twice the cost of Tums.",
                "date": "October 14, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "These antacids come in a tall, attractive metal tin, which was sealed and boxed. The flavor is not bad and very mild. Unfortunately, it didn't seem to do a lot to help. It seems like it should have helped, but maybe it's just for very mild symptoms.",
                "date": "October 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These are good calcium carbonate antacids, and work well. To me, the flavor is milder and the texture is a bit more starchy than the store-brand ones. The Tropical Fruit flavor is a basic inoffensive tropical punch flavor. They are tasty enough that I would not dread taking them if I were feeling queasy, but not tasty enough that I would be tempted to take them if not needed.The plastic-free packaging is very appealing and retro.My only major issue with these is the price. These are expensive, but they are good. If you want a calcium-based antacid, but the flavorings and colors in the standard brands bother you, they may be worth it.",
                "date": "October 13, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "This is a tin of 120 chewable antacid tablets from Wonderbelly, in tropical fruit flavor.  It arrived fresh and factory sealed, although the factory seal left a lot of glue behind on the tin, which is kind of annoying.  Anyway, the tablets taste really good and are not chalky or gritty.  They are effective at controlling acid.  My only complaint is that at the time I'm writing this the price for 120 tablets is $21.99, which is not a good value versus similar products.",
                "date": "October 11, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "These antacid tablets good for heartburn relief and have a great tast.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "This Wonder Belly antacid smells great when you open the container, they have a very pleasant smell and taste. The tablets are a bit larger but they are easy to chew and swallow. Made of good clean ingredients and work well.A bit more expensive than the ordinary antacid that I take which requires two 500 mg tablets but these taste better and work very well.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I got these mainly to try out to see if I could stand the flavor more than the other leading brands on the market.  I don't use antacids much but when I feel like I need them, I want something that doesn't make me gag.  These didn't initiate the gag reflex so that is already a plus.  It is a mild taste, although I can still tell it's antacid, it is more tolerable.  This product comes in a tin canister, about 120 tablets, all in strawberry milkshake flavor.  I think the strawberry flavor makes it more tolerable and less like antacid/medicine as opposed to lemon or mint flavors.  Good to have on hand in the rare instances when I need one to calm my tummy.",
                "date": "October 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "This worked as a typical anti acid medicine and worked to help settle my stomach. I appreciated the light flavors and the cute packaging. I’m not sure I would chose this brand over a generic one.",
                "date": "October 8, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I've tried similar products previously and they worked very well, So, I decided to order these antacid tabs.They were delivered in 9 days which a day or three earlier than originally estimated. The factory container had a couple of small dents but the tabs were in good shape.The tabs appear to be as described: Chewable, fruit-flavored and, best of all, they seem to work just the same as the others I have tried except these have 1000mg of calcium carbonate which is one-third more. They are white and about half the size of a checker.",
                "date": "October 8, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I deal with a lot of tummy problems, one of the main ones being acid reflux. I have a lot of sensory issues and really struggle with chewable medication. These tablets taste better than other ones on the market, but it's still a struggle to eat. They work fast and you only have to take two to see improvement for several hours. I'd purchase these over other ones!!!",
                "date": "October 7, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I gotnthia for someone who takes tumms like breathing air.Thought the different flavors would be a changeThey used them off and on",
                "date": "October 5, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "They taste kind of chalky, but the hint of watermelon flavor makes them edible.",
                "date": "September 29, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These are great, I’m so glad to have found a cleaner version of Tums. They work! The strawberry flavor is great, but to be honest the other two flavors are a little odd. The last thing I want to taste when I’m having acid reflux is mint/lemon.",
                "date": "September 22, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I llle how natural it is and it tastes great",
                "date": "September 4, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "Taste is okay not as flavorful as I expected.",
                "date": "August 15, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Some days I have to take a few, most days a couple. Good taste. Chews like candy.",
                "date": "August 9, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "All natural antacid. recommended by family.  Works as well as name brand antacids",
                "date": "July 23, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These are awesome, work very well!",
                "date": "July 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Flavor is spot on.They are fast acting.",
                "date": "June 6, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Taste is good but the flavoring is artificial unfortunately",
                "date": "May 13, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I take these anacids before bed to rid any discomfort to not be awaken in the middle of the night. So far so good",
                "date": "May 12, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Antacid pills only sort of work on me.  These work as well as any.  But they taste better and are higher dosage, so I don’t have to take as many.  The packaging is a little precious.  The metal canister, the shipping box printed inside and out, designed to look upbeat.  I don’t really need my antacid to be fun, but kudos to the package designer for getting a nice portfolio piece.",
                "date": "May 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I like this product quite a lot. I took one star off for the price. It is quite expensive, but it’s not easy to find a product without additives and so I paid the price for this.",
                "date": "May 5, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "They are a solid regular Tums replacement, but they're chalking and extra crunchy like Tums. They taste better. I was hoping they worked as well as Pepcid AC tablets, but they don't for me.",
                "date": "May 1, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Does as it says and better ingredients",
                "date": "April 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Upon getting these, the little sticker strip that was supposed to be the safety tag was not attached to the bottle, so it had me a little alarmed, but I still have it a shot. After intentionally giving myself just a slight heartburn with my favorite greasy food, I used 1 tablet to try and ease the pain, and ended up having to use 3 by the time it started to get a tiny bit better. The flavor of the magnesium carbonate is a tame tropical fruit, which is pleasant to enjoy. For being as simple as they are, I'm satisfied with their effectiveness",
                "date": "April 6, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Ordered strawberry milkshake and received lemon sorbet, which is a bit of a bummer. The lemon flavor is very subtle. I get more of a mintiness, but since I don't really like lemon this is a plus for me. Following the directions to \"wet in mouth before chewing\" reduces any potential chalkiness.",
                "date": "April 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I bought this product a copule days ago and they they have done amazing it has a great taste, not too bad as far as chalk texture compared to other products fast acting I would suggest to give a try",
                "date": "March 28, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I bought these because I read some reviews that treated them like some magic wonder drug. They're just fancy Tums. They do the same thing.",
                "date": "March 26, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Love love love the clean ingredients and the eco friendly packing!!I think that the tablets could be stronger, I am 6 months pregnant and dealing with very intense heartburn so it can sometimes be a coin toss whether it works with just one or I have to take two for relief.But overall I love Wonder belly and recommend it to all my mama friends",
                "date": "March 16, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Definetley better than tums, but not as good as pepcid AC",
                "date": "March 6, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "They work… but man Tums taste better. 😂However I like that they are a little better for you.",
                "date": "March 1, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I keep Wonderbelly on hand for mild heartburn and other stuff for tougher timed. I certainly prefer the ingredients of Wonderbelly, but it just doesn't help if I have a flare-up of severe heartburn. I bought the watermelon flavor, and it's fine. I'd prefer if the pieces were smaller or could be broken in half, but they're too hard to break with my hands.",
                "date": "February 29, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I found this antacid works great when taking about 15 minutes prior to consuming spicey foods. They taste is great. The down side is they do not work as well when taking after eating spicey foods.",
                "date": "February 25, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Although this product has been wonderful, it would be helpful to actually get the flavor I ordered.  Now I'm stuck with Lemon when I ordered Strawberry.  I'd rather you not ship the product if you don't have the right one.  Or take more care when packing.  Thanks.",
                "date": "February 23, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I used this product three nights in a row. The night of the Super Bowl feast. The night of the Super Bowl leftovers feast. And the night of the Fat Tuesday feast. Except for one minor issue, I didn’t have any of my usual stomach acid problems. I can’t say for sure what might have happened, or not happened, if I hadn’t used this product. But past experience tells me the sailing wouldn’t have been as smooth. The taste is pleasant enough. Sort of reminds me of an artificial orange flavor.",
                "date": "February 21, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Often with products that are free of fillers, artificial dyes and sweeteners, you end up with a product that is not as palatable as the more common products.  This Wonderbelly antacid is a pleasant exception.I over-ate at dinner tonight which left me with a bit of a sour stomach.  I tried two of the Wonderbelly antacid chewable tablets.  They worked just as well as my normal antacid.I was pleased that these were more easily chewed and the taste was better than the antacid I normally use.They are more expensive than the typical brands but are free of talc and dyes as well as being easier to chew.  This makes them not the best value, but for occasional use, this may replace my normal brand.",
                "date": "February 11, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Really good flavor very chalky not as strong as other antacids but effective",
                "date": "January 27, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "But it gets the job done and acts quickly!",
                "date": "January 22, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Tasty",
                "date": "January 20, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I love the lemon ones but they are awfully expensive. I don’t think that’s right! Please consider lowering the price somehow.",
                "date": "December 31, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "For some reason these antacids don't taste as chalky.  Works as intended",
                "date": "December 25, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I like the taste and ease on my stomach. It works",
                "date": "December 4, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "this does work but Rolaids are better",
                "date": "November 18, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Works as advertised ... but cost to much, plain & simple !",
                "date": "November 14, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I am an idiot and definitely was thinking these were something you drop into water or something and you drink it. Was ready to have a strawberry milkshake lol. But as they clearly state...they are chewables. I Have only used twice. Once for actual nausea and the second for preventative measures. Thankful to say they work well. And they are in a cute little container and good for travel!",
                "date": "November 9, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Lemon chiffon!",
                "date": "October 31, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I'm not entirely convinced these work better than Tums, but my son has been having acid issues and hasn't liked Tums.  So, I got him these to try instead and he seems to like them. He's complaining less about acid and is more willing to take them.  The do have a pretty decent taste, better than Tum in my opinion.",
                "date": "October 25, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "These are made out of cleaner ingredients when compared to other box brands. I prefer these over TUMS now. With all the bad ingredients in foods, drinks and everything we consume, it pays to read labels now. These are FREE from TALC and DYE! They come in premium packaging that is recyclable when you're finished. It's a WIN WIN",
                "date": "October 11, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Love these...taste is great.  Little different texture than TUMS, bit ended up liking.ot after a couple tries.  Have purchased again since my first order.  1 tab usually does the trick...",
                "date": "October 9, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "In my experience, these work much better than Tums. I'd have to take 4-5 Tums to get any kind of relief, and even then it seemed to be short-lived. These work only after 2 or 3 at most and seem to last much longer!",
                "date": "October 8, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Nice convient packages are easy to carry in your purse.  Flavor is decent.  Seems to help as well as other brands.",
                "date": "October 7, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "As I get older, I have noticed my stomach get a bit more sensitive to certain foods so I carry a pack of these with me for lunches/dinners out of the house. Each pack comes with three easy-to-chew tablets. I ordered the lemon sorbet flavor and it is pretty spot on. A good, mild flavor that's not too overpowering but overall enjoyable. They seem to be just as effective as other name brand antacids with no artificial sweetener or dyes. I like them so far!",
                "date": "September 24, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "What I like:-- these tablets have a mild lemon taste.-- from the several packets I've opened to use, the tablets are intact.-- I could easily bite/chew the tablets - easy on my teeth.What could be improved:-- packets are not resealable.Overall, the tablets work well.",
                "date": "September 15, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "First, I love the individual packages. I can just grab a couple and toss them in my purse without worrying about a powdery mess later. Second, the taste, unlike TUMS that I find to be quite gross, isn't even bad. It's kind of a light taste and much less powdery. They seemed to work okay the one time I used them. I'll update my review if that changes.",
                "date": "September 4, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I have often relied on another name brand of Calcium carbonate tablets when I got heartburn and it worked somewhat but decided to give this brand a try. I'm so glad I did.  They work SOOO much better than the name brand.  They dissolve smoother and taste better.  I was concerned about the flavor being lemon sorbet because I thought an acidic flavor when you have heartburn already was a terrible idea but honestly its great.  It doesn't taste acidic but rather a nice light lemon burst.  It is quite enjoyable.  You get 3 tablets in each pack of 20 but I have found that only 1 tablet seems to do the job if you are only experience light symptoms.  I will definitely considering reordering these for years to come.  They are a bit pricey though and that would be my main concern.  You can buy hundreds of the name brand for the price of 60 of these.",
                "date": "August 29, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I had purchased a different brand (started with G) that is dye/gluten free etc, and it had a weird aftertaste--almost moldy, not like strawberry.  Almost went back to Tums but found Wonderbelly and figured the Lemon would be the least odd taste. It's great. Very light and pleasant. And works as well as a Tums -- without the artificial colors.One point off for packaging.  The BOX with a glossy insert all about Wonderbelly -- what a waste. Can has info.  I was startled by the can--am not sure it will recycle with the aluminum beverage cans at my recycling center, but I guess if you aren't using plastic then it's glass or tin.  I would be fine with a foil zipping baggie (I could put them in my own jar if I wanted) but the screw top is better than a tin anyway (arthritic hands, it is easy to open.) Just get rid o the box, and insert",
                "date": "August 23, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I had been looking for Tums Naturals online as they are no longer available in stores.  This product popped up as I discovered the Tums Naturals have been discontinued.  They are a good replacement but not sure that they work as well or as fast.  But a good product!!",
                "date": "August 18, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "As in my title.  These are not at all like the more common tablets you find in most stores.  They are pink, and sort of taste like a cherry malted shake.  Not bad at all, but they kind of creep me out. They just LOOK like they will taste \"mediciney.\"  At least if the bottle itself wasn't also pink....But they work a treat.  They're also very soft and easy to chew,  which probably helps them to work quickly.",
                "date": "August 14, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These are perfect for carrying on the go because the individual packs have enough for a single dose. They're easy to chew, and the strawberry milkshake is flavor quite enjoyable. It was only a couple of minutes until my heartburn faded away.Another thing I like is that there are no dyes, no artificial sweeteners, no talc, and no parabens. The pouch is also eco-friendly because it's 100% compostable. It's definitely a win-win all around.",
                "date": "August 12, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "My go to relief for acid indigestion or upset stomach is a teaspoon of baking soda in a cup of water. This combination usually works well, but doesn't taste good at all. This Wonderbelly product does a good job of neutralizing the stomach acids and tastes pretty good.",
                "date": "August 8, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I found these tablets to work just like any other antacicd tablet...no better, no worse.  I do, however, like the flavor (it really does taste kind of like a strawberry milkshake).  I don't think I would make another purchase due to their price, but all said and done, they do what they're supposed to do.",
                "date": "August 7, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "These seem to work about as well as Tums (or the Costco equivalent).  They do taste a whole lot better though.  Not as chalky.  I wish they'd give nutritional information regarding the sugar content.  Hubby is diabetic and we have to be careful with supplements since they don't seem to be required to disclose that.",
                "date": "August 4, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "Very pleasant Flavor. They do calm indigestion well. Expensive with a lot of packaging. I suppose the 3 per bag is good for travel but I would prefer a single bottle. $0.67 per tablet is pretty expensive.",
                "date": "August 3, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "I suffer from chronic heartburn and was looking for something other than Tums. These work well, but not better than what I’m already using. This is kinda a one and done for me. They do taste good though!",
                "date": "July 30, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "A bit pricey for antacid tablets, but I had to try them. They are basic, white, chalky looking tablets. There are 20 packages in the box, with 3 tablets in each package. They are great for tossing in your purse or suitcase. The lemon sorbet flavor is very good. I could eat them for the flavor alone. I just happened to need an antacid the day they arrived. They work exactly as expected and quickly.",
                "date": "July 27, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "In this box you get 20 packs, each containing 3 tablets.  They taste good and dissolve quickly.  I get occasional acid stomach and one tablet seemed to take care of the problem right away.  I like the small 3-packs as they travel well, no need to carry a large container.",
                "date": "July 25, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "4.0",
                "content": "They work well, but I ordered Strawberry milkshake  and received watermelon mint instead. The box they were on stated Strawberry milkshake, but when opened, the canister was watermelon mint.",
                "date": "July 21, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "The texture of these is smooth and not at all grainy/chalky like Tums. Also unlike Tums, just one also goes a long way towards providing quick acid relief. My only gripe is the watermelon flavor seems to work best. I tried strawberry and it was much less effective, so if you have really bad acid, go with the watermelon.",
                "date": "July 13, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Got these to try as an alternative to tums since they're chalky and my bf refuses to ever take them because he doesn't like the flavor.  He will actually take these and doesn't mind the flavor.  They're still chalky of course but not as bad and they work pretty well on heartburn.  Also if you're worried about artificial sugars these don't have them, they smell like they do (I'm allergic and usually stuff that says there's no artificial sweeteners but they do have that smell) but these don't bother me at all",
                "date": "June 30, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Not as strong as tums",
                "date": "June 28, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Wonderbelly Antacid Chewable Tablets - Maximum Strength Calcium Carbonate Acid Neutralizer - Instant Heartburn Relief, Acid Indigestion & Sour Stomach - Vegan (Lemon Sorbet)First impressions: Nice container of tablets. They smell lemony.Installation/setup: Take as directed.Final thoughts: I like the flavor of these, so many antacids are chalky and mint that I have grown so tired of using them. These are fresh and new and I’m liking how they work as well as the others without the minty aftertaste. I like these and I’m glad I got them.⭐️1 star - I don't recommend it at all, poor quality.⭐️⭐️ 2 stars - I don't recommend it, it has multiple faults, or a very high price.⭐️⭐️⭐️ 3 stars - It's passable, It has some faults but the quality is ok for what it is.⭐️⭐️⭐️⭐️ 4 stars - Product quite acceptable, it does what it promises.⭐️⭐️⭐️⭐️⭐️ 5 stars - Product that I totally recommend.",
                "date": "June 10, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "You pay for the fancy packaging but the antacided works like it should. I think the Apple packaging engineers designed the container and wrapping. Nice. I got watermelon flavored tablets. I don't like watermelon flavor, but that's not their fault. The container makes them nicely portable. I'd recommend them, but only as a luxury antacid.",
                "date": "June 10, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I get frequent heartburns from the medication I take. The tablets has been a lifesaver. They had a pleasant lemony sweet taste with no aftertaste. The tube is a bit bigger than I was expecting but I appreciate that it is more ecofriendly. The pills worked quickly and lasted a while. I only needed one for relief.",
                "date": "June 8, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I order the lemon sorbet.  The flavor was nice and mellow.  The canister is pretty cute too.  I like the information paper the came with it.  I use Tums on a regular bases for acid reflux.  Wonderbelly antacid's go down easily and work well.  $11.99 for 60 is high.",
                "date": "June 4, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "This stuff works ok.  Tastes good but VERY mild flavoring.  Functionally it works, but not all the good.  No better, for me at least, than any of the generic antacids you can buy anywhere for a couple bucks.  Those are often REALLY hard, but this is much easier to chew.  Still a bit hard but not bad at all.  I will use the ones I have, but I wont order more, I will return to using my normal Pepcid Complete: much better and stronger taste, soft to chew, more effective and only need one to last an entire day.",
                "date": "May 30, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I liked how it came packaged and the actual canister. I also like that it comes with an informational pamphlet. I would say they taste like tums and feels like it. I do like that one tablet is more dosage than tums. I felt relief in a good amount of time.",
                "date": "May 30, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I've tried all sorts of products that help with heartburn and acid, and I usually try to avoid antacids and use more natural supplements. But the branding for this product caught my attention. I tried the lemon sorbet and it's a nice mellow flavor. The tablets are a bit bigger than preferred, but they are easy to chew and dissolve fairly quickly. I would probably only use these for mild instances of heartburn and other related stomach issues, but overall a decent alternative to the more popular antacid tablets out there.",
                "date": "May 29, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These seem to work better and faster than the antacid tabs I usually take. I love the container they come in and the flavor is pleasant, although a tad sweet for my taste. They are chalky, so if you're accostumed to the smooth texture Tums Smoothie tablets you may not like these. As for me, I can't complain because these seem to work better and at half the dosage.",
                "date": "May 29, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I definitely have a more sensitive stomach and find I have to use some sort of antacid more often than not. I’ve always really disliked a lot of the options at the store because they have artificial flavoring and colorings in them. I do use just a little bit of baking soda and warm water a lot but get concerned about the sodium, so have been looking for an alternative. I was excited to be given the chance to try these out. First off, the canister these tablets come in is very nice, and I like the little card included, which explains about the product and their mission as a company. The flavor of these tablets is fantastic! I was a little disappointed to see that you had to take multiple of them potentially for it to work properly. I took one tablet the first time I needed, and it did help right away… But I did need to take another one a couple of hours later. That being said, I do think this is a very good product and a better alternative to the other options out there.",
                "date": "May 28, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These antacid tablets have a slightly better flavor than Tums or store brand antacids but an aftertaste that lasts a little longer. They come in the cutest aluminum screw top can, which should prevent them from being affected by humidity or any damp. I took one to settle my acidic stomach and it worked as well as any other antacid I use. While all the product packaging is recyclable,  I do wish that they'd reduce their product packaging and not include the branded cardboard box the can arrives in. The can itself is sufficient packaging and the additional box isn't necessary to protect the product.",
                "date": "May 26, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Seems better than Tums. I'm glad I brought it.",
                "date": "May 20, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "it definitely works. I like the flavor, it doesn’t feel too chalky. Minus one star, because it takes a little bit longer than I would like for it to fully stop feeling like my throat is melting, about 10-15 mins. It definitely starts working though within like 2 minutes. Also, it smells just like Extra watermelon gum!!",
                "date": "April 4, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "my stomach!",
                "date": "April 2, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Thank you",
                "date": "March 30, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I think the flavor needs a little bit of work. But I guess watermelon and mint what do you expect? It does do a great job of cutting the acid. They are not chalky like some other antacids.",
                "date": "March 13, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I really liked the product after my first order - good flavour and doesn't leave a weird aftertaste, just mildly chalky which I'm ok with. I ordered again but this time the sticker was ripped and the seal inside was broken. I can't return or exchange the problem bottle and I can't find a way to contact the seller. Not sure if it was tampered with or just damaged in shipping, but I won't ingest anything that looks like it could be unsafe. Disappointed that I can't get some customer service to help resolve the issue, so I'm wondering if I'll be comfortable ordering again. Don't want to waste another $15 on a product I like but can't use.",
                "date": "January 3, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "The flavor of these tablets arent really too bad, but the texture is a little bit hard to get down. They have very chalky texture. Besides that, they work pretty decently, and I like their flavor a lot more than other brands of antacid chewables Ive tried.",
                "date": "December 1, 2022",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "My partner and I get heartburn occasionally, him more than me. Tums and generic Tums do the job just fine to alleviate heartburn. But the main issue is the taste of those tablets. That's where these flavored tablets excel at.No longer do you have to deal with the taste of Tums, but now you get three flavors: Strawberry Milkshake, Watermelon Mint, and Citrus Mint. The main ingredients of 1000mg each of calcium carbonate are the same as Tums, but now your heartburn medicine tastes better!However, the price. It's pretty high in comparison. So now you have to decide between taste or price. I leave that choice to you.",
                "date": "November 8, 2022",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "I got this as a \"natural\" alternative to sugar free Tums.  Mistake.  This has sugar in it and is the same calcium carbonate found in Tums.  So they took out the flavor other than sugar and give you a regular antacid.  But if someone is going to create and market a product that looks \"healthy\" or natural, they should eliminate the sucrose (sugar) from the product.  Not helpful at all.",
                "date": "December 12, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "I have pretty severe issues with GERD and gave this product a try. While they work well, the flavor and consistency is really no better than tums. I like the fact that these tablets don’t have artificial ingredients which is why I’ll probably keep buying them. The flavor and chalky texture leaves a lot to be desired. I’d recommend these for anyone wanting an alternative to tums. I will deal with the flavor and chalkiness in exchange for symptom relief.",
                "date": "November 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I have long term acid reflux.  This works just ok.  Not as well as Gaviscon.",
                "date": "October 28, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These work pretty well and taste decent for antacid tablets. They aren't a good value though and I won't be ordering again.",
                "date": "October 17, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "Cute metal tin. Too bad it arrived dented. The strawberry milkshake flavor is much more mild than I expected. I could barely taste the strawberry, but at least they don't taste bad. They still have that chalky texture, to be expected. Despite being maximum strength, they weren't hugely effective for some reason. There are a lot of tablets for $21.99.",
                "date": "October 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "120 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Sorry had to take more than once daily. Did not meet my needs.",
                "date": "October 12, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "This product works pretty well but causes really bad leg cramps….",
                "date": "October 11, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Love the taste and that they are non toxic. They do not work as well as tums and I feel like I have to take way more of these to get any sort of relief. I will not be buying more especially as my heartburn has gotten much worst in last month of pregnancy.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I don't really like the flavor that much, it isn't bad but it isn't good. As for effectiveness I feel tums works better? I don like this is to supposed to be a clean product but for the price and effectiveness it is not worth the price being charged. I won't be purchasing this.I had no adverse effects from it, it just doesn't work very well for me.I also don't like that it comes in a can, I don't like the idea that it is sitting in an aluminum can, to me that isn't healthy.",
                "date": "October 10, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "Taste isn’t bad, but it’s still pretty chalky. Most important thing is that it works well.",
                "date": "September 27, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I started getting Wonderbelly when Genexa was too expensive.  The ingredients are similar and both are \"Clean\".  They both taste similar, sweet with a chalky-ness.  Typical antiacid stuff.  But now, this one costs just as much as Genexa, on the subscribe and save feature anyway AND, you get 12 tablets more with Genexa so, this one is now going bye-bye cause it makes no sense to continue paying more for less than what I got before.  When these were $7.99 a can I was okay with that.  Now they are $10+ a can or $12 if you don't have them on the subscribe and save.  I am all for clean antacids without the Talc and other junk but it makes no sense economically to continue to get this brand when it's now the same cost as my previous brand.  Sorry Wonderbelly.  Put 72 in that can and I might change my mind back because I do like the fact you use metal which is more widely accepted for recycling than Genexa's plastic containers.",
                "date": "September 12, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "If you’re looking for a different flavor, these are it. But I’m not sure they work as good as the other brand",
                "date": "September 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Great at relieving heartburn but the texture is very chalky and flavor is not very good.",
                "date": "August 22, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I thought I would try something a little more powerful than my normal purchase. These only work for approximately Half an hour. And they definitely don’t taste like lemon, sorbet or minty.",
                "date": "August 6, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Heartburn",
                "date": "July 16, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Not as effective for me as some of the other OTC antacid… tastes good.",
                "date": "July 5, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I was not impressed. Not only did I break any fingernail trying to get it out of the box. The pills are as hard as concrete and they leave a white coating in you mouth. Yuck",
                "date": "June 28, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Works exactly like typical brands like TUMS. The taste is good as antacids go, but not good enough to warrant the price. You are better off saving your money and sticking to the more appropriately priced generic options.",
                "date": "May 26, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Se ve mas grande en la foto que muestran",
                "date": "May 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Tastes good, like that it has no additives, but I have to take twice as many to get same effectiveness as tums naturals.",
                "date": "May 21, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Seriously it tastes exactly how you'd imagine a scented candle tastes. Also expensive for the size/servings per container. But like I said it works... Just took two after inhaling lobster Mac n cheese and feels better",
                "date": "May 17, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Gave me a kidney stone",
                "date": "May 14, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These work decently well. I took them while pregnant. However, the aftertaste was bad and left my mouth feeling nasty. I prefer Genexa antacids if you’re looking for a clean ingredient alternative to tums",
                "date": "May 14, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Taste good but doesn't do the job. I needsomethong stronger and that lasts through the night which this doesn't do.",
                "date": "May 13, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Not a great tasted but effective",
                "date": "April 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "The jury is still out on this. I get the same results as Roland's and Roland's taste better. Less expensive.",
                "date": "March 11, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Pretty expensive and not real palatable",
                "date": "March 11, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I bought these because I thought they'd be a cheaper alternative to Pepcid. They are. But the chalky taste makes me not want to take them unless 100% absolutely necessary. By the time that happens, it's already too late.",
                "date": "March 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Package arrived crushed and no way to return",
                "date": "March 9, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "That’s being brutally honest. Worst tasting antacid I’ve ever tasted, however it worked quickly. Will not be buying anymore of this brand in any flavor, but the can as a container is cool. A bit pricey but cool.",
                "date": "March 6, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I bought this product because it has no dyes or artificial ingredients. But don't kid yourself, it does not taste like strawberry milkshake. Also it's a little hard on the teeth.Basically you're paying for the cute little can it comes in.",
                "date": "March 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "could be more efficient, it's more of a treat than really a relief for burning stomach pain",
                "date": "March 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Honestly, I think I'll be sticking to my generic evil corporate antacids with their deadly dyes and world corrupting plastic being that I'm really noticing no difference in effectiveness, this may be a bit weaker honestly.You get a small metal tin that's screw on lid likes to misthread, it's filled with nondescript white tablets that have a vague fruity flavor I couldn't place but mostly taste of cornstarch. They stick in your teeth shockingly badly.The acid killing effect exists, and I don't need them often or extra strength but being that these are the same dosage as my other ones, they don't seem to be quite as effective, I find myself wanting to reach for a second.Overall I'm just not impressed.",
                "date": "February 24, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Being prone to occasional acid reflux, I often rely on store-brand antacids from retailers like Target or Walmart. They typically offer a range of fruity flavors that make them quite palatable, akin to Smarties candy.Enter Wonder Belly Antacid, boasting a formula free from talc, dyes, parabens, and artificial sweeteners. Intrigued by its health-conscious composition, I eagerly tried it, only to find the taste falling short of expectations.Despite my initial excitement for its purported health benefits, the taste of Wonder Belly Antacid left much to be desired. While I value natural ingredients, the flavor didn't quite hit the mark for me. Nonetheless, prioritizing health over taste, I'm inclined to continue consuming it.Additionally, I observed that the product comes in an aluminum bottle, packaged within a small cardboard box. While I appreciate the effort to minimize harmful ingredients, I couldn't help but feel the cardboard packaging was unnecessary and wasteful.In summary, Wonder Belly Antacid presents a health-conscious option for managing acid reflux, but its taste may not appeal to everyone. While I commend its natural formulation, improvements could be made in flavor and packaging efficiency.",
                "date": "February 14, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I had really high hopes as I suffer from GERD and often have coughing fits. While the Taste is terrific, I don't see any improvement with my GERD after using about half of the can. Oh, it is a cute little can.",
                "date": "January 26, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Wanted to try something other than Tums.  Watermelon Mint flavor was not a good combo. It was definitely more chalky than tums and didnt handle my acid reflux as well.  Will stick to the Tums naturals.",
                "date": "January 19, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Like tums.",
                "date": "January 8, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Most of the tablets were broken… so there will be a lot of powder at the bottom I’m sure. They definitely work and I’m glad I’m not eating so many tums (6 months pregnant) but after I run out I’ll save my Pennie’s and go back to tums.",
                "date": "November 30, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I get terrible acid reflux at night and had been taking a Tums before bed every night, which helps immensely. That said, I wanted to get away from the terrible ingredients in Tums so I tried these. My initial thought was that they’re delicious, love the flavor. It’s a subtle watermelon flavor that’s also cooling. I always end up feeling nauseated shortly after taking one and I can’t understand why. It’s such a bummer.",
                "date": "November 20, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I guess this is personal preference , but it kinda tasted like a pink colored sweet chalk stick that (I never tasted )... And boy was it sweet with a hint of fruit It recommended 2, I stopped at one because it contained sucrose, the chemical name for table sugar at #3 on the list. It seems the tablets could be smaller if they added less corn starch that adds to it's bulk , but oh well 😔..",
                "date": "October 9, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "This product did not even touch any of my discomfort. And sadly I can’t return. Scale bake on packaging and save some money.",
                "date": "October 9, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I appreciate that this product contains no talc or parabens.  I don't like the taste or texture though.  It's chalkier than rolaids and the taste is way to artificial for me.  I haven't noticed that it works any better or worse than rolaids.",
                "date": "October 7, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Why Not?  This is a great premium product with calcium, I use it to nibble for mineralizing my teeth.  It's great for that, but OOPS I discovered when a friend mentioned, it contains sugar.  Just make a stevia version so I can continue buying and using your great product, please and thank you.",
                "date": "October 7, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "It works like a Tums would sometimes it will help and sometimes it does nothing. My reason for purchasing it was to find something different from tums that worked better. I taste wise its pretty good but I won’t buy it again. Prilosec is a lot better.",
                "date": "September 7, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I like the taste but they aren't as effective as tums for me.",
                "date": "August 19, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Cute package.  Product works same as generic tums",
                "date": "August 16, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "It would be nice if they had a stevia or an unsweetened option, sugar aggravates acid reflux because it is acidic. I hope they don't ever use saccharine, aspartame, sucralose as they are garbage ingredients.",
                "date": "August 16, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Works great, does everything it says overall happy with product but I am a little let down because I ordered the variety pack expecting lemon sorbet and got citrus mint in my pack instead.",
                "date": "August 9, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "He product worked but was lacking flavor. You do have to take them multipole times yo get the same effect as a once a day pill. Do you would expect a great flavor to make the pill go down better do to say. Unfortunately the lemon sorbet is lacking and I wish I had gone for the strawberry watermelon. Maybe that has more flavor and is less caulk.",
                "date": "August 7, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I was hopeful, but they didn't really make a difference mitigating my indigestion vs. some of the usual brands of antacids.",
                "date": "August 4, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These are fancy tums thats all",
                "date": "August 2, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "Acid reflux",
                "date": "July 22, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "It was not the antacid I needed it hurt my stomachSo I bought Gaviscon which was better for me.I am sure others could benefit from it. I take many meds and it is probably why it bothers me.",
                "date": "July 1, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These are equal in effectiveness to similar products but do not contain the junk ingredients. But it’s difficult to justify the cost since I go through a lot. Also, I ordered the strawberry flavor but they sent the wrong ones. I survived.",
                "date": "June 21, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I don't care for the taste.  Won't order again.",
                "date": "June 16, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Not great at doing what's needed but an ok flavor.Bottom line,doesn't work",
                "date": "June 15, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I bought these for acid reflux. They work really well for that purpose. But if you have issues with irregularities and constipation, I would not recommend. These are big in size, chalky and dry. They will act like a plug and it’s miserable. Beware.",
                "date": "June 14, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I avoid using these because they are rock hard and very difficult to chew.",
                "date": "June 13, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I really wanted to like these, they taste good also minus the after taste it leaves in your mouth for a while after…. Almost like a bland dryness. But if they even do help, the relief is very short lived and not enough as is. Sadly TUMS is a million times more helpful.",
                "date": "May 16, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "They don’t help really at all. I like that they are a chemical free version of tums but tums at least work…",
                "date": "March 9, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Sorry to say, but Tums is a better product.  I am trying to stay away from Tums, and go to a more natural supplement, but this product does not relieve my acid problems as well as Tums.",
                "date": "March 3, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "They do an effective job of neutralizing acid, but they're a bit like necco wafers or conversation hearts; a chore to chew.",
                "date": "February 12, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "It cameopeedwith. Capsules out I package",
                "date": "January 12, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Yes, it relieves heartburn and acid indigestion well.Eh, the flavor is ok.No, I'm not too impressedCan't say they are better than other less expensive over the counter antacids.",
                "date": "November 22, 2022",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These tasted ok, not as good as Tums, did not work as well as tums.  They remind me of the Tums smoothies, in that they have a smooth taste.  I imagine these are probably healthier for me, so I'll use these when I had light indigestion.",
                "date": "November 8, 2022",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "I got this product for my husband who takes the leading competitor's brand quite a lot. The part that drew me in was 'Wonderbelly is free from talc, dyes, parabens, preservatives, common allergens, artificial sweeteners and is vegan, dairy free, gluten-free, and NON-GMO Project Verified.' I'm all for less crud in the stuff we ingest.My husband had heartburn that evening. He took a few of these and unfortunately said they don't work as well as the brand he normally takes. With it also being more expensive it won't be something we end up picking up again.",
                "date": "November 2, 2022",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I don’t use antacids often, but my boyfriend does. He usually gets Tums or the store brand version, and I don’t like these when I find myself needing some.The Wonderbelly antacids are much less chalky in the mouth than the tums or their generic versions. Instructions state to let them sit in the mouth for a few seconds and that makes them easier to chew through. I much prefer the texture of these.I am also allergic to red food coloring and love that these have no food dyes.They also come in an aluminum can. Sticker seal on outside and a foil seal under the cap.One tab helps soothe the heartburn quickly.This strawberry milkshake flavor tastes like a strawberry milkshake, but I prefer the mint version because I miss that cooling sensation with this flavor.I think these are really pricey for regular antacid users because you’ll be going through them rather quickly, but if you are like me and you use them once in a blue moon then they are definitely worth it.To see the photos I attached more clearly, while on a computer right click and select ‘Open image in new tab’ for the full sized image.",
                "date": "October 21, 2022",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I usually don't mention price, but in this case, the shopper would really need to justify paying $.24 (as of 10/9/22) per tablet for these. They are upfront about the fact the active ingredient is exactly the same as in many other antacid tablets. I used these and they work the same as the big name products, but I'm pretty sure if you frequently consume antacids, you are not going to shell out 4 times more per tablet than, say, Tums Naturals, which have the same amount of calcium carbonate and check off a couple of the same sales points as this product.They may be worth it if you are sensitive to any unnatural or unnecessary ingredients, like dyes or sweeteners, which some other brands may or may not contain. And they do come in cute aluminum cans, that probably have a greater chance of actually getting recycled than plastic containers. Then again, 180 of these tablets come in 3 containers versus 1 container for the same amount of the name brands (as of this writing, these only seem to be offered in 60 tablet cans).It's up to you. My 3 star rating is meant to indicate the pluses and minuses could go either way, depending on the shopper.",
                "date": "October 9, 2022",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "2.0",
                "content": "Works great but the flavor is over powering with orange.",
                "date": "November 2, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I was disappointed in these.  They are HARD & taste like chalk.  Your tongue will be WHITE & disgusting taste in Your mouth.  Ick!",
                "date": "November 2, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Sorry to say, but this is quite expensive and it was no different than the other brands I've tried.",
                "date": "October 1, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I tried it a few times and it did nothing.  The other remedies work fast.  I suspect it varies from person to person.",
                "date": "September 20, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "These taste terrible!Hopefully they will work as I ran out my script.Won't be buying again",
                "date": "August 26, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I used this item for heartburn but, it didn’t work well for me.",
                "date": "August 18, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Not good for pregnancy heart burn. But it is very tasty.",
                "date": "August 18, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Save yourself some money and just buy Rolaids. There is nothing exceptional about this product.",
                "date": "August 8, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I was looking for any switch from Tums, but these were not it. Taste just as chalky and grainy—even worse, however, is that they simply don’t work. For the price (crazy high!) I expected them to at least do the job, even if they didn’t taste like a strawberry milkshake. Bummer.",
                "date": "July 18, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Do these work? Sure, as good as any chewable antiacid, like Tums or Rolaids. Do they taste good? Um, not exactly. The initial taste for the first two seconds is pleasant, but it quickly fades to a licking-an-envelope lingering bitter taste that sticks around for hours after taking these. I dread needing to take it, but for the cost, refuse to toss them. Do yourself the favor or sticking with a drugstore antiacid.",
                "date": "June 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I had high hopes for wonderbelly not gonna lie. I love their cute packaging and had heard great things. As someone who suffers from chronic GERD, and hates the taste of Tums, I thought I would give it a shot. First off, the taste is on par with Tums If not more chalky in my opinion. I did not enjoy it at all. Second, I felt they did not work as well as Tums in relieving my symptoms. And third, they cost twice as much as Tums. I will sadly stick with Tums.",
                "date": "May 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I wrote s positive review initially. After three days my gut felt tight and I was out of sorts.Could it have been the flavoring ingredients?I stopped taking them and went back to normal. When my stomach is upset I take an old fashioned family favorite…lemon or cider vinegar and water.",
                "date": "May 8, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I bought these from a local store because I suffer from the occasional acid reflux and wanted something else other than Gaviscon.Firstly, mint is acid provoking, so why is it in a product for the very thing it's supposed to calm down??Secondly, doesn't work at all. At all. I took one and ended up coughing worse than usual from acid reflux all night. Took two the best day, even worse acid. Took Graviscon the third night and it works well.A good idea and cute packaging but it just didn't work.",
                "date": "March 10, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "The flavor is fine. But for the price, I paid, I was hugely disappointed in all the broken tablets in the can. I wouldn't repurchase due to this.",
                "date": "March 9, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "The tin canister is lovely and versatile. The initial tropical flavor was pleasant, but within seconds of swallowing, my acid reflux was worse than before I took it. I was also left with a nasty metallic taste in my mouth for over a hour. Nothing I ate or drank helped to get rid of the taste. I  left a message with the seller but didn’t hear back.",
                "date": "March 7, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I have tried a number of antacids and was hopeful as the flavors looked interesting and clean ingredients nice but found that it was pretty ineffective on my indigestion. I had to take 4 pills to get any relief and that was still not sufficient.",
                "date": "February 26, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I ordered the variety pack and only got 1 item",
                "date": "February 21, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "2.0",
                "content": "THE PACKAGING IS INTENSE...LIKE IT WAS SOME KIND OF GIFT...THE PRODUCT IS NOTHING SPECIAL AND CAN BE PURCHASED ELSEWHERE FOR LESS...I FIND BAKING SODA IN WATER AS EFFECTIVE",
                "date": "February 10, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "These tasted much chalkier and less flavorful than the tums melts..my kid couldn't even eat one",
                "date": "January 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Trying to get to this product through the packaging was kind of like trying to open a package with a Barbie inside it. You have to use all sorts of scissors and other implements, you usually hurt yourself in the process, and it takes an ungodly amount of time for very little reward. There was a ton of cardboard packaging on the outside of this product. And it all fit together like a Jenga game so it was hard to tell which pieces needed to be pulled out of which. The amount of product inside was minimal. And I just feel so guilty for making all of this go to the landfill. It's really really expensive and I wouldn't repurchase based on that factor alone. But the lack of environmentally friendly packaging makes a future purchase even less likely.",
                "date": "January 7, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Just a strawberry tasting tablet",
                "date": "December 24, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "This is essentially the same product as Tums just a little stronger. You still have to take several tablets (up to seven per day)! I will not be purchasing this again. I’d prefer with Pepcid, personally.",
                "date": "October 30, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I find no difference between these and any over the counter antacids.",
                "date": "September 22, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Kinda disappointed they don’t work",
                "date": "August 19, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I experienced heartburn and decided to try the Wonderbelly Maximum Strength Antacid Chewable Tablets. However, in my case, after taking two tablet, I encountered an unexpected outcome. Within just 5 minutes, I developed a severe stomach ache, which seemed to be the opposite of the intended relief. It's important to note that this could be a unique reaction specific to my situation.",
                "date": "August 11, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "2.0",
                "content": "Quite disappointed that I bought a $30 can of Tums that has even less product in it too.  I was hopeful but it doesn’t work any better.  I am going to continue with pretzels as they work better than any meds I’ve used.  I think because the pretzels are so dry it gives the acid something to go after instead of refluxing it up.",
                "date": "June 20, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Taking these at recommended strength seemed to have resulted in some really significant dehydration and digestive issues for me. I was taking them at top dosage on can.",
                "date": "June 9, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Fantastic product which does everything it claims. I'm a long term reflux sufferer and cannot stand the flavor, texture, and mouth feel of typical antacids. Wonderbelly tablets work great and don't leave your mouth full of an awful taste, and your teeth full of chalk.However, one of two bottles recently arrived with the tamper evident outer AND inner seal broken. I have no recourse to return or get a refund. Without support of the product I can't feel comfortable ordering again.Too bad, too.",
                "date": "May 24, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Won’t be able to try or return; arrived with both the outer sticker and inner seal broken.",
                "date": "April 13, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I love this product, ordered it a second time and it arrived with both the safety seal on the product box and on the container broken. They rejected my first review, so hopefully this will go through.",
                "date": "April 5, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I bought these because I thought they were more “natural” with less fillers etc. They are but I had intestinal issues after taking them. Maybe it’s just me, but threw them away and back to TUMS with no artificial color. I really was hoping they’d work for me.",
                "date": "January 25, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "I have acid reflux, so I'm looking for better ways to settle my stomach. These work just as well as Tums, maybe even faster acting.However, I just can't stomach the flavor. They are chalk tablets, and the chalk taste doesn't combine well with this flavor.",
                "date": "October 29, 2022",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "2.0",
                "content": "Seem to be as effective as Tums and Rolaids.  Easy to chew/swallow.  I didn't care for the taste at all.",
                "date": "October 8, 2022",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Strange how the ingredient list is covered up in all their product photos; so I Googled-- Included isSUCRALOSE, AN ARTIFICIAL SWEETENER known to cause cancer  (among other questionable ingredients).Check it out before you buy.",
                "date": "November 10, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "These things were not touching my heart burn the slightest. It never made a difference if I ate 1 or ate 3, I was always just left with a mouth full of slightly minty chalk. The \"extra strength\" is the strength within yourself to swallow whatever this is.",
                "date": "October 31, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "These actually give me a stomachache and make me feel worse.",
                "date": "October 28, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I personally do not want something distasteful.",
                "date": "October 22, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This stuff tastes horrible and does absolutely nothing. I'm throwing out what I have left and going back to Gas X.",
                "date": "September 14, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I previously tried another product from this company and was disappointed with the flavor. Determined to give them another chance, I decided to try a completely different product and flavor. Wonderbelly Antacid is free of dyes and talc, which is why I was interested in trying it. However, I was concerned because the product lacked a seal and the anti-tamper sticker was not even attached. Considering the significantly higher price compared to other brands, I believe there should be stricter safety measures in place. Unfortunately, due to these concerns, I don't feel comfortable consuming the product and will have to discard it.",
                "date": "September 13, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Not happy with this product, I have tried many products and hoped this was different and better, but I was very disappointed.  This product doesn’t work at all.  Even off brand Pepcid works better than this product.  Don’t recommend this product",
                "date": "August 30, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I received expired product, I took one because I’m having SEVERE heartburn & it tasted funny. As in expired funny. I looked & it expired LAST MONTH.",
                "date": "August 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Didn’t seem to work as good as the competition",
                "date": "August 1, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I was really looking for a better alternative to Tums.I’m 6 months pregnant and would get horrible stomach cramps and diarrhea.I finally figure out it was because of these tablets! The severe cramps and diarrhea would only happen on the nights I would take these! So unfortunately this was money down the drain.",
                "date": "July 25, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Received the item today. Container was damaged and the tablets spilled all over the inside of the box. Likely not safe for consumption. Item is also showing it is ineligible for return.",
                "date": "July 23, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I’m pretty sure they’re paying big bucks to do marketing bc I fell for the trap. This does not work. I had the Worst cramps, massive headache  taking this. Unfortunately I will not be taking this again. Fail9",
                "date": "July 19, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I was sent the wrong flavor and unfortunately there is no option to exchange for the correct one. I have gotten the watermelon before and they do work, but the lemon flavor I got instead tastes like lemon pledge.",
                "date": "July 9, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Better google this product…has been subject of successful lawsuits.",
                "date": "July 8, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This is super chalky, tastes awful, and to top it off, ISNT RETURNABLE",
                "date": "July 3, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "OMG Absolutely horrendous got cramps, gas and diarrhea for two days while I took this, I do appreciate the fact that it is cleaner with less chemicals and artificial sweeteners, but I cannot continue to take it, and it cannot be returned",
                "date": "June 23, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Does absolutely NOTHING for me🤬‼️",
                "date": "June 15, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Taste like flavored chalk.  I have absolutely no idea how the rating is so high.Save your money and get a known trusted brand, unless you like indigestion, then definitely get these.",
                "date": "June 13, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Tastes like watermelon chalk. Not very pleasing. I guess it worked, could only tolerate 1.",
                "date": "May 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Very disappointed after reading the reviews this product didn't work for me.",
                "date": "May 11, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Poor response to relieving my indigestion! Too expensive for the quality and quantity I received! The taste was not pleasant or so good at all! Took too long to melt in my mouth some before being chewed completely and digested! Poor durability! Side effects of unsettled stomach acid indigestion!Poor results demonstrated!",
                "date": "April 30, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Too sweet. It has sucrose. It's gritty.",
                "date": "April 22, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "As other reviews have mentioned, no matter what you order, they send lemon. It works like tums, so if that’s what you’re looking for, this is good. Wish they’d send the flavor we ordered, though, as you can’t return these.",
                "date": "April 20, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "They Taste Great But Do Not Work For Me, I Wish I Hasnt Wasted My Money 😩",
                "date": "April 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Did nothing for my stomach. And you can’t return so don’t buy.",
                "date": "April 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "For the price, it was disappointing, the product was hard and chalky, not soft as advertised",
                "date": "April 8, 2024",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I just paid a ridiculous amount for a can of...CHALK. That's it: calcium carbonate. Chalk. Also sold under the brand name Tums. I feel like an idiot because the ingredient was plainly disclosed, but I didn't look it up. And it's not returnable, nor will Amazon give a refund for it. Learn from my mistake!",
                "date": "April 4, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Unfortunately I found out that I have a nasty reaction to magnesium. This has magnesium in the ingredient list, I finally put the connection that this was the side effect that caused my diarrhea. Not a pleasant experience.",
                "date": "April 1, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Have taken for two days now and they aren’t anything special. For the price I’ll just stick with tums when I need them.",
                "date": "March 21, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "It's really clean. It's loaded with sucralose and other artificial sweetners.",
                "date": "March 20, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Contains cancer causing ingredients.",
                "date": "March 5, 2024",
                "location": "United States",
                "flavor": "Tropical Fruit",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Sticker used as tamper seal outside and no seal inside. I can’t verify these weren’t tampered with and they aren’t able to get returned. Will not ingest or buy again.",
                "date": "February 28, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This product is just basically TUMs in a fancy bottle",
                "date": "February 21, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The product does nothing for heartburn.",
                "date": "February 18, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The media could not be loaded.\n                \n\n\n\nIf you want to try to be healthy, but risk breaking a tooth this product is for you I’m bombed I spent over 10 bucks on it",
                "date": "February 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Ordered the 3 , received only  1, waited a couple of days , still not received the others, but I was charged for the 3",
                "date": "February 9, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Leaves a metallic taste. Horrible!",
                "date": "February 6, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "It tasted terrible and didn't help my stomach. I am frustrated that I couldn't get a refund. I won't order from Wonderbelly again.",
                "date": "February 2, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "It doesn't work",
                "date": "January 30, 2024",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I’e bought this exact same product from Target and it tastes fine. This exact same flavor tasted rancid. Not sure why. I tried to do a return but it’s not eligible and I saw no place to contact the seller.",
                "date": "January 26, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I really wanted to love this… taste so good, love the environmentally, friendly packaging! These just don’t work. I usually only have to take 1 maybe 2 for my old brand. But these I’m talking the max (7) and it’s not working at all. Maybe for 5 minutes, then the acid is back.",
                "date": "January 24, 2024",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "waste on money does not help  no return",
                "date": "December 28, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I do like the product but I didn’t receive the lemon sorbet flavor I ordered, I received watermelon mint, which I don’t like, and there are no returns or exchanges allowed for this product.",
                "date": "December 23, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "I didn’t like the flavor or the way it worked. It gave me a sharp left side pain after I took it and it caused uncomfortable bloating! No thank you they got my 12 bucks once and I feel that was too much it’s going in the trash!",
                "date": "December 12, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I got the old stock with old packaging and short expired date, very disappointed...",
                "date": "November 22, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "When I tried it the first time I felt nauseous. I thought that was due to my gerd. I gave it another chance and felt nauseous again. I don’t know if it’s the chalky taste or what it is but I feel worse every time I take it. I should just stick to Pepcid. They also don’t allow returns so be careful when you buy it. If they truly believed that their produce worked I don’t know why they wouldn’t allow returns. I would not recommend.",
                "date": "October 11, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Not so great.",
                "date": "October 11, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "they had me until they said in the ad \"trust the science\". we all saw how that worked out.",
                "date": "October 4, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Nasty, Nasty, Nasty... bad after taste lasts for hours, can't get that taste out of your mouth no matter what you try and eat behind it to get rid of it.  Toothpaste or mouthwash after just makes it worse!  So nasty never could tell if they really worked...",
                "date": "September 28, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I bought this because I have a lot of acid and this product didn't do anything to help, it also comes in an aluminum container which is harmful and on top of everything they don't accept returns. Buyer be aware",
                "date": "September 27, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I purchased the Strawberry and really liked those. I thought I would try the lemon but they were awul.  Beware before purchasing as you can't return these.",
                "date": "September 19, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I pretty severe herd these didn’t help at all people with mild dyspepsia may find effective",
                "date": "September 14, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Only got one of the 3 bottles. No happy. Nor will I buy again",
                "date": "August 22, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Ordered the 3 pack, received only 1",
                "date": "August 19, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "I've tried using this as a antacid on multiple occasions and this stuff just seems like it doesn't want to work. It's unfortunate that the price of these are so expensive and they haven't done anything good for my stomach. I'll stick to tums (unfortunately).",
                "date": "August 14, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Tasted like eating chalk  and it didn’t work.",
                "date": "August 5, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I have only one complaint about this product - THE PRICE!!!  Why are they charging $0.67/tablet?!  That's 10x more than the cost of a similar number of 1000mg TUMS-brand tablets!  That's crazy!Aside from the price, everything else about these antacids is nice.  They have a nice strawberry flavor and quickly remedied my heartburn after eating too much pizza and sauce recently.  I definitely liked the product, but I didn't see any significant benefits of these antacids over TUMS or similar products.  There's nothing to justify the 10x price increase.  To me, that's offensive.  ONE STAR!  Sorry, Wonderbelly!  What were you thinking?!",
                "date": "August 3, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "Advertised 3 but you only get one!, not for the price they charge, not worth it!",
                "date": "July 19, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "I ordered the combo pack of 3 flavors and only one flavor came in the mail. Not happy.",
                "date": "July 18, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "I was excited to give this a try but the seal was torn and there was powder from the tablets that leaked everywhere. I am disappointed in the packaging because it definitely isn’t usable if it has been tampered with.",
                "date": "July 10, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Item arrived with safety seal and freshness seal both missing, and is ineligible for return or replacement. $12 gone.",
                "date": "July 3, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "package was opened and seal on bottle broken. Would not buy again - I should have returned it.",
                "date": "July 2, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I thought these would be a quick help for acid reflux.  Didn’t work at all for me.  Probably depends how severe your issues are.",
                "date": "June 26, 2023",
                "location": "United States",
                "flavor": "Lemon Sorbet",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Yuck!!  These have a very chalky nasty taste.Enough said.🙄",
                "date": "June 23, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The product arrived without a aluminum seal on the strawberry flavored.  It was in the lid but not attached to the bottle.  Tamper proof lid seals not working.  Was able to open lid and \"seal\" again on all bottles.  To make it all worse I am not able to return this defective product.  I will not buy again.",
                "date": "June 12, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "1.0",
                "content": "I can't rate the actual product accurately.  It was not sealed and sticker looked like it had been taken off and then reapplied.  13 bucks down the drain.",
                "date": "June 2, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Outside seal was broken, inside covering had been tampered with - immediately threw it in the garbage.",
                "date": "May 16, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I got the watermelon mint, the outer branded cardboard box tape was opened and the inner sticker and safety seal were clearly tampered with as well. I’ll have to throw out for safety but they do smell really good.. too bad they don’t accept returns or give refunds because I would really like to try them",
                "date": "May 15, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I really needed this a product but when it arrived the box was opened and the seal was opened. Very disappointed.",
                "date": "May 4, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Took 2 and nothing… took another 3 about 2 hours later and still nothing. I was trying to find something other than Tums that might work a bit better but this was not the product.",
                "date": "April 28, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Dissatisfied. The seal was clearly broken. This is not safe to consume as it is not sealed.",
                "date": "April 23, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "These are awful.  They are thick tabs. They are dry and chalky and barely chewable.  Not what you want when you're feeling ill.  Flavor isn't awful, but these are barely edible.",
                "date": "April 20, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Seal arrived broken upon arrival. Unable to return/refund.",
                "date": "April 5, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Wanted to try but the seal under the cap was broken on arrival and I didn’t wann risk it. Can’t get a refund cuz the item is not eligible or something. Guess I’ll just stick with tums.",
                "date": "April 1, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The sticker seal on the lid was ripped and the inside seal was loose. Can’t get a replacement or refund. Waste of money",
                "date": "April 1, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This item was opened already.  I would like refund or return.  When I click on return, it says item is not returnable.",
                "date": "March 30, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Took one tablet, it dry out my mouth so bad I had a hard time just to sallow, it lasted about six hours and still have a linger affect to it,I wouldn't remand this to nobody ..bad product.",
                "date": "March 18, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Doesn't do anything for my heartburn.",
                "date": "March 3, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "These are not gummy’s at all but something that dissolves in your mouth. Absolutely not what I was looking for. I threw them away.",
                "date": "February 21, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "When we received the package. The package was sealed BUT the product inside the top was loose and when we took the top completely Off  the seal on top of the container was completely loose. There was tape over the top and down the side of the container.",
                "date": "February 2, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The foil was torn off half way",
                "date": "January 23, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "“Do not use if sticker is broken” seal was already opened, and this isn’t “eligible” for a refund. Waste of money",
                "date": "January 19, 2023",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This product arrived with a broken seal. I mean, it’s not returnable so hopefully it’s not a returned item. Do I have to Google what they look like so I’m not taking something else? It’s not reassuring and I’m not comfortable taking these now :(",
                "date": "January 17, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "This didn’t work to good. Tums are much better",
                "date": "January 10, 2023",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "Received with the seal broken and metal top taken off and placed back on. Extremely frustrating that I can't just get a replacement and have to repurchase.",
                "date": "December 17, 2022",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "i didnt review this product bc it was opened and the safety seal was not even attatched. got refund.",
                "date": "November 27, 2022",
                "location": "United States",
                "flavor": "Strawberry Milkshake",
                "size": "60 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "The aluminum container came dented, which is fine for an eco friendly packaging.However the safety seal was broken and Amazon will not allow a return or replacement.",
                "date": "November 16, 2022",
                "location": "United States",
                "flavor": "Watermelon Mint",
                "size": "60 Count (Pack of 1)"
            }
        ]
    },
    {
        "asin": "B0C67N355H",
        "title": "Wonderbelly Antacid Chewable Tablets Bundle Effective Heartburn and Instant Acid Indigestion Relief, Maximum Strength (Strawberry Milkshake & Lemon Sorbet)",
        "rating": "4.6",
        "number_of_ratings": "52",
        "distribution": {
            "5": "78%",
            "4": "13%",
            "3": "6%",
            "2": "0%",
            "1": "3%"
        },
        "reviews": [
            {
                "rating": "5.0",
                "content": "I always have some of these ready to help with any heartburn that may rear it's ugly head. All I have to say is cleaner label items with no colors is what all of our food and over the counter items need to be!",
                "date": "November 13, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "These are the only tums that control my heartburn and they aren't as chalky as standard tums.",
                "date": "November 9, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "Wonderbelly for a fast  acting relief.  Has a great taste and the best part is the clean ingredients.  No talc, no dyes, no parabens, no artifcial sweeteners.  This has it all!! It tastes great.",
                "date": "August 28, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "Tasts great, works fast , love the different flavors",
                "date": "June 18, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I love that these have natural ingredients!  They work so well!  The taste is amazing & not chalky at all.  My husband even liked them. I would definitely buy again.",
                "date": "May 29, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "I just LOVE this stuff and even my die hard Pepcid using husband reaches for these first nowwithin 25-35 minutes my stomach feels so much better",
                "date": "May 11, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "5.0",
                "content": "The strawberry is a 100 times better than the lemon",
                "date": "May 10, 2024",
                "location": "United States",
                "flavor": "",
                "size": ""
            },
            {
                "rating": "3.0",
                "content": "These seem to work and taste pretty good, but are something I can’t buy on any regular basis without coupons.",
                "date": "August 6, 2023",
                "location": "United States",
                "flavor": "",
                "size": ""
            }
        ]
    },
    {
        "asin": "B0CX44G88R",
        "title": "Wonderbelly Bloat + Gas Relief, Extra Strength Chewable Tablets, with 125 mg Simethicone, No Talc or Dye, Strawberry Shortcake, 42 Count",
        "rating": "4",
        "number_of_ratings": "74",
        "distribution": {
            "5": "46%",
            "4": "29%",
            "3": "13%",
            "2": "5%",
            "1": "7%"
        },
        "reviews": [
            {
                "rating": "5.0",
                "content": "I would probably have liked the flavor with strawberry better but I only had the option to select this one. They work very well! They're a bit chalky but I've definitely tasted worse!  I also love the packaging as it doesn't use any plastic and you could probably use the tin to put something else in afterwards! They're also a great value for the price! I'm very happy with these and will keep using them!",
                "date": "July 4, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I have tried Wonderbelly products before and liked them. These are pleasant tasting and I find they are not as chalky as other products on the market. Recently I had a bloated stomach full of gas and rumbles. I had one of these and half an hour later things had calmed down to the point where I was no longer uncomfortable. Based on that alone, I would say these work. Very easy to use and good ingredients. You pay for what you get and the value is there on this product.",
                "date": "July 3, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These work so great and the ingredients are great quality. I love the containers they come in. I trust the brand and that's important. The flavor is okay, not great, not bad but it's not candy so it's not going to taste like it. It works at least as well as anything else I've taken for gas",
                "date": "June 20, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These chews work as intended. The texture isn't as chalky as an antacid, but the texture is different than expected. The strawberry flavor is mild. I like the tin packaging. I've ordered other products from this company before and have liked everything so far.Overall I'm happy with the product and I'd order again or try another flavor!",
                "date": "June 9, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Seriously, I don't know how WonderBelly does it, that their chews are always so delicious! I have tried their antiacid chews and they are simply the best, in effect, taste and texture. This Bloat + Gas Relief chews are just as good! They are effective to relief bloatiness, helps to keep things under control.This supplement is Gluten free, Non-GMO, Vegan friendly, Dairy free.  With an expiry date that is about two years from when the item is delivered.",
                "date": "June 3, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Taste isn’t wonderful but I wasn’t expecting it to, it is however subtle tasting, easy to consume and works.",
                "date": "June 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "They work well but I found you do need to take 2. They do have an alright taste but not like a mango smoothie unless that smoothies main ingredient is chalk dust, they are very chalky but the taste is ok . They do help with gas and bubble gut .",
                "date": "May 20, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These Wonderbelly bloat and gas relief tablets are an essential for me. I got the mango smoothie flavor which has a mild creamy mango flavor with a little sweetness but not too much. They are easy to chew with a chalky texture but not unpleasant. I take these after those meals that hit me the wrong way, and it does the trickI also love the packaging. It comes in a cute little screwtop tin. It shows that they put effort into developing a brand identity that sets them apart from other similar products. I will definitely be keeping this stocked in the medicine cabinet",
                "date": "May 13, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I have become a fan of this trustworthy brand, as everything I have tried so far has been just as effective as any other store name brand equivalent, including this simple but effective simethicone.",
                "date": "May 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This product is truly effective for me, possibly due to its real medicine formulation, unlike some other gas and bloat products that are merely supplements. With a concise ingredient list featuring more natural options, it not only works but also tastes great. The strawberry flavor is a plus. I highly recommend it.",
                "date": "May 7, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I ordered these chewable tablets in the mango smoothie flavor. I think they taste a lot better than the generic mint ones that I normally get, and they are not too sweet.  I like that they don't get stuck in the teeth and break down pretty easily.They seem to work as well as the normal ones I take. No complaints on this end!Bonus point for the super cute tin and lack of additives!",
                "date": "May 7, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Small metal jar, works as well as other brands.",
                "date": "May 6, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This was impressively effective - relieved gas and bloating in about 20 minutes for an evening.  I've used it twice now and been pleased both times.It doesn't have a great taste - it's not sweet at all and has little to no flavor and a chalky texture.  Since there's no sweeteners, that makes sense.  But it's not that unpleasant to chew - just not something I'd pick for a snack.  Takes very little time to chew, so it's not a huge hardship.Would recommend, may even get more when this runs out.",
                "date": "May 6, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Absolutely love using Wonderbelly Bloat + Gas Relief, it tastes good and fast!",
                "date": "May 5, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Reviewing Wonderbelly Bloat + Gas Relief, This is a great product. It works quickly and effectively, and it tastes great, minus the slight chalky taste that all these types of products seem to have. It’s easy to chew and the smell isn’t offputting. It’s also what I consider a “clean” product, without all the extra junk often found in products of this sort. It’s also a great price for 42 supplements.",
                "date": "May 5, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I like this brand Afro their quality products that work without unwanted additives. These have a light strawberry vanilla (almost like a milkshake) taste. Takes little while to dissolve in the mouth. It doesn’t leave the usual chalky aftertaste. Great for taking on the go as well.",
                "date": "May 4, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "I'm giving it a full five stars because it honestly works. I remember when my kids were small, giving them simethicone drops for their tummy troubles, and being a little jealous of how quickly it seemed to help them when i couldn't find anything that effective for me - well queue this stuff, sure it's years later, but here it is! I have digestive issues and these little chews actually really help, and quickly too. I don't really like the texture of them - after the first few chews they start sticking to my teeth - but it's absolutely worth the annoyance for how well these work. The flavor is pleasant, but very very minimal.",
                "date": "May 3, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These simethicone tabs are very mild tasting. They are not chalky in my opinion, but rather a bit creamy as you chew them. I found they worked pretty quickly to relieve bloating. I would definitely order these again.",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "Almost worked instantly. The flavor is Strawberry short cake. I definitely don't think it tastes like that. But it wasn't horrible. I will be purchasing this in the future. As it did exactly what it said.",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "This tin of Wonderbelly Bloat + Gas Relief, Extra Strength Chewable Tablets, with 125 mg Simethicone was well received. The yellow tin of 42 simethicone tablets were boxed and sealed. The tin has a screw off top and the square white tablets are marked with a 202 imprint on one side and W on the other. Easy to chew and has good relief. Distributed by Ginger Health Co. Austin, Tx.  Expires 4/26.",
                "date": "May 1, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These Wonderbelly Bloat + Gas Relief Tablets are great to have on hand for times when you need a little tummy relief.  The recyclable tin container they come in is adorable and a unique way to package them, and the tablets themselves are yummy.  The first time I unscrewed the lid, the sweet mango smoothie flavor came wafting up at me and I knew they were going to be a hit.  Thankfully they calm my stomach just as well as they smell and taste, so they're a hit for me.  One of the best things about these tablets, and one of the main reason I ordered them is they don't contain any additives, dyes, parabens, preservatives or artificial sweeteners, plus they're dairy and gluten free, vegan, and non-GMO, all things that are important to me when choosing products for my family.",
                "date": "May 1, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These  tablets have a nice flavor and are easy to chew. This is  nice because you do not need water so they are great when you are on the go. Simethicone is my go to remedy for bloating  and these tablets work as expected. Nice!Thanks for reading this review. Have a lovely day 🌹",
                "date": "May 1, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "5.0",
                "content": "These anti-gas tablets are small and easy to chew without leaving residue behind in the teeth. They are very slightly chalky at first but that goes away quickly and it is easy to swallow after chewing. The taste is a bit like strawberry freeze dried ice cream. I took one after a heavy meal and felt that it made me more comfortable. Recommend to keep these around for the holidays. I'm sure you'll appreciate having them available.",
                "date": "April 30, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "The Wonderbelly Bloat + Gas Relief, Extra Strength Chewable Tablets, is 125 mg Simethicone which is used in most of the commercially available products to reduce gas/flatulence.  Normally they are available in a pill format and as chewable.  This product has made it hip in a chewable variety with a great mango flavor.  This make taking the pill a better experience. It comes in a neat old fashioned container which I am sure will re-use around the house.",
                "date": "June 29, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These have a sort of strawberry milk chalky flavor which kind of threw me off. But I am happy to say they actually get the job done, and do work! My stomach was much happier after using these.",
                "date": "May 30, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I ordered the Wonderbelly Bloat + Gas Relief Extra Strength Chewable Tablets in Strawberry Shortcake to help with everyday digestive issues. I am not a fan of the flavor, because there really isn't any flavor. It tastes chalky and bland. I did find that it relieved my symptoms after a time, about the same as any other gas relief tablets. I appreciate that these are made without additives or dyes and come in a recyclable metal container instead of plastic. For those reasons, I would choose these over the store brands.",
                "date": "May 20, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Tastes good, texture is a little odd after you chew it but overall they seem to work well.",
                "date": "May 19, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "These chewable gas relief tablets come packaged in a cute little tin. They taste okay but they are chalky and tend to stick to my teeth. Once I get it washed down with water, the discomfort is alleviated fairly quickly. I will keep these on hand.",
                "date": "May 17, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I found Wonderbelly Bloat Gas Relief to be just as effective as other gas relief options I've tried, so, it works! The flavor is pretty decent. I wouldn't eat it like it was candy if given the option lol, but the flavor is still a nice switch from other tablets that are almost always some kind of cherry or berry flavor. The tin that the tablets come in is really cute, and if it weren't for gas I'd probably find a way to reuse it lol.",
                "date": "May 15, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I do not find chewing these tablets enjoyable. The tablet has a hint of sweet flavor and breaks up easily into powder. As you chew, the powder becomes a paste and the flavor and the paste just don't go well together. I imagine a chalk coated with sugar powder would taste just like this. Very unpleasant experience, I'm slightly terrified to go through it again lol. But I will have to since I had less bloating.",
                "date": "May 15, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "This review is for: Wonderbelly Bloat + Gas Relief, Extra Strength Chewable Tablets, with 125 mg Simethicone - 42 CountThis is the exact same active ingredient used in another popular anti-bloat product, however this one is on the pricier side. Each tablet is a nice size. A little bit smaller than an inch and relatively tasty so you can easily chew on these. This contains no dyes which is great. The product is made in the US which is also a big plus. However, I may not repurchase this as the active ingredient is the same as for a product that costs baout 3x less.",
                "date": "May 11, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "This has the same ingredients and milligrams as many of the drug store brands.  It works well and I like the tin container the tablets are in.  Plus, there are no artificial ingredients in these.  I got mango smoothie and they smell sooo good, but the taste, not so much.  They taste chalky, but it's not horrible to me.  It's not a taste that lingers.  The directions say take 1-2 depending on the amount of discomfort.  I don't need them often, but when I do, 1 tablet works for me.",
                "date": "May 9, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "when i first ate one of these i was kind of grossed out. but soon after, the effects happened and my stomach immediately felt less bloated and i felt more comfortable. i feel these are less intense than tums too which i really like. i recommend them!",
                "date": "May 8, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Wonderbelly bloat and gas relief tablets with 125 mg simethicone Mango Smoothie flavor 42 count. Dairy free, gluten free, non gmo, dye free, cruelty free, vegan, and eco friendly bottle. As per usual for this brand, the packaging and design were on point! Expiration date 4/2026, more than a year and a half out!The tablets are large and firm yet soft and very easy to chew. They’re talc free but still a little chalky in the mouth. The mango flavor is very mild. They smell a lot stronger than they taste, weirdly. I like the flavor of their ant-acids a lot better. They work well, though, and fast! I felt noticeable relief from gas and bloating with 15 minutes of taking one.I think this is a good quality brand and a nice quality product, for what you’re getting. I just feel they’re a tad overpriced.",
                "date": "May 6, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Although this smells wonderful, taste good with quality ingredients, the packaging needs work for quality - not only did it take a while to be delivered, with the box completely destroyed but also the pills all broken up as well. IT did not make for easy pill ingesting.",
                "date": "May 4, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I love that this product is vegan, cruelty free and non gmo. I love that this product is in a eco jar and has no talc or titanium dioxide in it. Value sized tin gives you 42 tablets. The chewable tablets are easy to chew and swallow. Taste like a creamy mango flavor with a veryight sweetness that I like. Works really well, about 6 mins after I take them for stomach pressure that I get from gastric bypass. High quality ingredients.",
                "date": "May 3, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I actually ordered Strawberry Shortcake since I didn't see Mango Smoothie as an option until later, and wished I had ordered that, but I ended up receiving Mango Smoothie anyways! These tablets are large, somewhat soft, and not impossible to chew one bit. They're not chalky, or hard to chew, but the mango smoothie flavor was not so apparent. I think I've been conditioned to expect overly sweetened supplements with 3-5g of some type of sugar (or sugar substitute) so part of me was a little disappointed. The tablets are a bit large, but not intimidating at all. It works as expected and I can still fit a couple of them fit perfectly in my little travel pill container in case I need some. I'll be back for more!",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "I really like these. They work exactly as described. I would purchase them again. Good product. Would recommend.",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "So this definitely helps but the taste is horrible . But the tablets are not too big they are like dime size so it don't take long to chew them. I like the little tin container. I will keep these on hand!",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Flavor was excellent.  Gas relief was exceptional.Packaging was not.  Most of the tablets were broken upon arrival.  Packaging needs improvement!",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "4.0",
                "content": "Kinda weird but work as expected. Taste is ok, it’s not a super pronounced flavor but you can tell it’s strawberry. There is a waxy feel to them when chewing. Not necessarily bad, just not what I was expecting. Packed in a nice reusable metal container with a screw top lid. There is a safety seal which I appreciate however I was able to just lift it off without it being noticeable that it was removed and feel that if I could do that, so could someone else with ill intentions. Maybe a complete seal over the top or shrink wrap would be a better option so theres never any worry.",
                "date": "April 30, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I do like that I can put some of these in a container & place in my purse when I’m away from home & I don’t need water to take them. They are very big chewable tablets. They have a dry chalky taste, yet not a bad taste. The cost per tablet is very pricey compared to others that you can find on Amazon with the exact same ingredient. I will rate it as 3 because the value is not great.",
                "date": "June 22, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "This pack of gas relief tablets arrived quickly and well packaged. The product packaging is clearly labeled to what the contents of the package are. The tin includes 42 chewable simethicone tablets in the Mango Smoothie flavor. A serving size is 1-2 tablets for anyone 12 years old and up, meaning a jar can give you 21-42 servings. This has easily identifiable and limited ingredients that make this a clean option. The tablets taste okay, though don’t really speak to a mango smoothie flavor. They are easy to chew but I did find that they get caked in my teeth and leave an awkward texture in my mouth. These do help with bloating and gas discomfort, though I can’t say they are an effective as a pill form. The price point for this is comparable to what I’ve seen it at my local store. Overall, these are a good option for those who don’t like to take pills or those who have dietary restrictions, but the texture and limited potency does impact whether I would buy this again in the future. Would recommend to specific buyers.",
                "date": "June 5, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I don’t like the flavor of these. They taste chalky. There is a little bit of flavoring, but it isn’t pronounced. These aren’t sweet, so that’s a plus if you don’t like sweet flavors. It’s like eating a regular calcium supplement that has only been very mildly sweetened. The tablets are very dry and stick to your mouth. You really need water to get these down. The safety seal isn’t very safe. Instead of a seal that covers the entire inside of the bottle, there is just a single strip of metallic tape that runs down one side of the lid and can. You could easily lift the un-taped side of the can, tamper with the product, and re-seal it to make it look new. I really don’t like taking medicine this way. I would rather swallow pills than try to chew this dry, chalky, nearly flavorless tablet. Also, at $11.99 for one bottle, they are expensive for simethicone and calcium, which are very common. You can find them all over on Amazon for cheaper.",
                "date": "May 16, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I have been a fan of Simethicone for years. While I consider the well known brand (G__Ex) to be a staple of our \"first aid\" cabinet, this one works, but does not appeal in the same way to me . That said, here's my longer review with more details:Company Transparency: Trademark Activity for “Wonderbelly” is first noted in 2021. They have a really cute and information dense webpage with an “About Us” that says their Ginger Health company was started by Lucas Kraft (who’d struggled with gut issues) and his business oriented brother Noah. They “put together an amazing team of gastroenterologists and pharmaceutical scientists” to create products that don’t  use ingredients like dyes, talc, or artificial sweeteners (note: That doesn't mean \"filler free\"). They provide biographies of their team of three medical advisors!Accountability for Safety: They claim to be  \"clean label project\" certified, vegan, non-GMO, and free of artificial dyes, artificial sweeteners, talc, titanium dioxide, parabens, gluten and dairy. Although most of  Wonderbelly's antacids are verifiably Clean Label Project Certified (checks for things like lead, purity), I don’t see this product listed at the Clean Label Project webpage (yet?). (In theory the CL Project certification *might*  be as good as GMP certified, even better in a sense, because it tests store bought product that is purchased anonymously, not samples provided by the company. And then they do spot checks periodically. Genius!) (Disclaimer: Just my uneducated opinion about the value of the testing).Quality: Unfortunately the unique safety seal on this is easily tampered with. I can lift it and replace it so that it looks like it did originally. Otherwise, this container includes 42 chewable simethicone tablets that each contain 125 mg of Simethicone, which is the same amount as Gas-Ex Extra strength. They recommend taking 1-3 tablets with symptoms. They have a strong vanilla/strawberry scent, and taste the same (not personally a fan).  They don't dissolve quickly as I chew, but are dry and become a damp clump that sticks to my teeth. The ingredients are said to be “Clean”.  They seem to work for me, bringing quick relief (simethicone is great).I was happy to see other folks enjoyed these, because although I love strawberry shortcake, these just didn't do it for me. They stuck to and filled in the crevices of my molars so that the taste lingered for a long time (I have lots of dental work, so maybe that's the issue?), but I love the \"Clean Label project\" quality verification idea and that some of Wonderbelly's products can be verified in that program!",
                "date": "May 6, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "Don't love the scent and flavor.  My biggest issues is the container.  It is a tin with a loose piece of tape.  Not tamper proof.  But they work.",
                "date": "May 5, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "I’m reviewing on taste only, as I just sampled one but fortunately haven’t had to use it for its intended purpose yet.They are definitely chalky tasting, but not as chalky as the leading brand. I don’t know why the flavor name “mango smoothie” made me think they would be less chalky. The flavor is mildly artificial mango but not very sweet. I think that’s good as the flavor fades quickly after eating them, because when your stomach is upset, the last thing you want is a lingering taste. We will see how they work when I really need them!",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "3.0",
                "content": "These chewable tablets are very chalky and gets all over your hands. They are big tablets compared to other brands. I do like that they do not have talc in them nor any dyes. Some of the tablets were broken but I actually liked that because If I just had small discomfort that day I just took a tiny piece. These do work to an extent, but if you have severe gas, you might need more than one. The jar is metal which I really loved because it was easy to take with me because I did not have to worry about them spilling out since they have a screw cap. I will say I did not care of the mango smoothie flavor, it tastes odd. It probably has to do with the 'natural flavors' in the ingredients list. I do like these but would love just a mint flavor.",
                "date": "May 2, 2024",
                "location": "United States",
                "flavor": "Mango Smoothie",
                "size": "42 Count (Pack of 1)"
            },
            {
                "rating": "1.0",
                "content": "I could not even try this product since the safety tape was not attached.",
                "date": "May 12, 2024",
                "location": "United States",
                "flavor": "Strawberry Shortcake",
                "size": "42 Count (Pack of 1)"
            }
        ]
    }
]